stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32u3xx_ll_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_LL_RCC_H
#define STM32U3xx_LL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx.h"


#if !defined (UNUSED)
#define UNUSED(x) ((void)(x))
#endif /* !defined (UNUSED) */


/** @addtogroup STM32U3xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Constants RCC Private Constants
  * @{
  */
/* Defines used to perform offsets*/
/* Offset used to access to RCC_CCIPR1, RCC_CCIPR2 and RCC_CCIPR3 registers */
#define RCC_OFFSET_CCIPR1       0U
#define RCC_OFFSET_CCIPR2       1U
#define RCC_OFFSET_CCIPR3       2U

static __IO uint32_t *ccipr_addr_reg[3] =
{
  (__IO uint32_t *)(uint32_t) &RCC->CCIPR1,
  (__IO uint32_t *)(uint32_t) &RCC->CCIPR2,
  (__IO uint32_t *)(uint32_t) &RCC->CCIPR3
};

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Exported_Types RCC Exported Types
  * @{
  */

/** @defgroup LL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
  */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t SYSCLK_Frequency;        /*!< SYSCLK clock frequency */
  uint32_t HCLK_Frequency;          /*!< HCLK clock frequency */
  uint32_t PCLK1_Frequency;         /*!< PCLK1 clock frequency */
  uint32_t PCLK2_Frequency;         /*!< PCLK2 clock frequency */
  uint32_t PCLK3_Frequency;         /*!< PCLK7 clock frequency */
} LL_RCC_ClocksTypeDef;

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined (HSE_VALUE)
#define HSE_VALUE      32000000U   /*!< Value of the HSE oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined (HSI_VALUE)
#define HSI_VALUE      16000000U   /*!< Value of the HSI16 oscillator in Hz */
#endif /* HSI_VALUE */

#if !defined (HSI48_VALUE)
#define HSI48_VALUE    48000000U  /*!< Value of the HSI48 oscillator in Hz */
#endif /* HSI48_VALUE */

#if !defined (LSE_VALUE)
#define LSE_VALUE      32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined (LSI_VALUE)
#define LSI_VALUE      32000U     /*!< Value of the LSI oscillator in Hz */
#endif /* LSI_VALUE */

#if !defined (MSIRC0_VALUE)
#define MSIRC0_VALUE   96000000U  /*!< Value of the MSI RC0 oscillator in Hz */
#endif /* LSI_VALUE */

#if !defined (MSIRC1_VALUE)
#define MSIRC1_VALUE   24000000U  /*!< Value of the MSI RC1 oscillator in Hz */
#endif /* LSI_VALUE */


#if !defined (EXTERNAL_AUDIO_CLOCK_VALUE)
#define EXTERNAL_AUDIO_CLOCK_VALUE    48000U /*!< Value of the external AUDIO_CLK in Hz */
#endif /* EXTERNAL_AUDIO_CLOCK_VALUE */

/**
  * @}
  */


/** @defgroup RCC_LL_EC_MSIX_SET_FREQ_AFTER_STANDBY  MSIS/MSIK frequency after standby
  * @{
  */
#define LL_RCC_MSISDIVS_RANGE_5            (RCC_CSR_MSISDIVS_0)                         /*!< around 12 MHz (reset value) */
#define LL_RCC_MSISDIVS_RANGE_6            (RCC_CSR_MSISDIVS_1)                         /*!< around 6 MHz */
#define LL_RCC_MSISDIVS_RANGE_7            (RCC_CSR_MSISDIVS_1 | RCC_CSR_MSISDIVS_0)    /*!< around 3 MHz */

#define LL_RCC_MSIKDIVS_RANGE_5            (RCC_CSR_MSIKDIVS_0)                         /*!< around 12 MHz (reset value) */
#define LL_RCC_MSIKDIVS_RANGE_6            (RCC_CSR_MSIKDIVS_1)                         /*!< around 6 MHz */
#define LL_RCC_MSIKDIVS_RANGE_7            (RCC_CSR_MSIKDIVS_1 | RCC_CSR_MSIKDIVS_0)    /*!< around 3 MHz */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_RCC_ReadReg and  LL_RCC_WriteReg functions
  * @{
  */
#define LL_RCC_CIER_LSIRDYE                RCC_CIER_LSIRDYE      /*!< LSI Ready Interrupt Enable */
#define LL_RCC_CIER_LSERDYE                RCC_CIER_LSERDYE      /*!< LSE Ready Interrupt Enable */
#define LL_RCC_CIER_MSIRDYE                RCC_CIER_MSIRDYE      /*!< MSI Ready Interrupt Enable */
#define LL_RCC_CIER_HSIRDYE                RCC_CIER_HSIRDYE      /*!< HSI Ready Interrupt Enable */
#define LL_RCC_CIER_HSERDYE                RCC_CIER_HSERDYE      /*!< HSE Ready Interrupt Enable */
#define LL_RCC_CIER_HSI48RDYE              RCC_CIER_HSI48RDYE    /*!< HSI48 Ready Interrupt Enable */
#define LL_RCC_CIER_MSIPLL1RDYE            RCC_CIER_MSIPLL1RDYE  /*!< MSIRC1 PLL-mode ready Interrupt Enable */
#define LL_RCC_CIER_MSIPLL0RDYE            RCC_CIER_MSIPLL0RDYE  /*!< MSIRC0 PLL-mode ready Interrupt Enable */
#define LL_RCC_CIER_MSIPLLUE               RCC_CIER_MSIPLLUE     /*!< MSI PLL-mode with LSE unlock Interrupt Enable */
#define LL_RCC_CIER_MSIPLLHSUE             RCC_CIER_MSIPLLHSUE   /*!< MSI PLL-mode with HSE unlock Interrupt Enable */
#define LL_RCC_CIER_MSIKRDYE               RCC_CIER_MSIKRDYE     /*!< MSIK oscillator Ready Interrupt Enable */
#define LL_RCC_CIER_LSECSSE                RCC_CIER_LSECSSE      /*!< LSE Clock security system Interrupt Enable */

#define LL_RCC_CICR_LSIRDYC                RCC_CICR_LSIRDYC      /*!< LSI Ready Interrupt Clear */
#define LL_RCC_CICR_LSERDYC                RCC_CICR_LSERDYC      /*!< LSE Ready Interrupt Clear */
#define LL_RCC_CICR_MSIRDYC                RCC_CICR_MSIRDYC      /*!< MSI Ready Interrupt Clear */
#define LL_RCC_CICR_HSIRDYC                RCC_CICR_HSIRDYC      /*!< HSI Ready Interrupt Clear */
#define LL_RCC_CICR_HSERDYC                RCC_CICR_HSERDYC      /*!< HSE Ready Interrupt Clear */
#define LL_RCC_CICR_HSI48RDYC              RCC_CICR_HSI48RDYC    /*!< HSI48 Ready Interrupt Clear */
#define LL_RCC_CICR_MSIPLL1RDYC            RCC_CICR_MSIPLL1RDYC  /*!< MSIRC1 PLL-mode ready Interrupt Clear */
#define LL_RCC_CICR_MSIPLL0RDYC            RCC_CICR_MSIPLL0RDYC  /*!< MSIRC0 PLL-mode ready Interrupt Clear */
#define LL_RCC_CICR_MSIPLLUC               RCC_CICR_MSIPLLUC     /*!< MSI PLL-mode with LSE unlock Interrupt Clear */
#define LL_RCC_CICR_MSIPLLHSUC             RCC_CICR_MSIPLLHSUC   /*!< MSI PLL-mode with HSE unlock Interrupt Clear */
#define LL_RCC_CICR_CSSC                   RCC_CICR_CSSC         /*!< Clock security system Interrupt Clear */
#define LL_RCC_CICR_MSIKRDYC               RCC_CICR_MSIKRDYC     /*!< MSIK oscillator Ready Interrupt Clear */
#define LL_RCC_CICR_LSECSSC                RCC_CICR_LSECSSC      /*!< LSE Clock security system Interrupt Clear */

#define LL_RCC_CIFR_LSIRDYF                RCC_CIFR_LSIRDYF      /*!< LSI Ready Interrupt Flag */
#define LL_RCC_CIFR_LSERDYF                RCC_CIFR_LSERDYF      /*!< LSE Ready Interrupt Flag */
#define LL_RCC_CIFR_MSIRDYF                RCC_CIFR_MSIRDYF      /*!< MSI Ready Interrupt Flag */
#define LL_RCC_CIFR_HSIRDYF                RCC_CIFR_HSIRDYF      /*!< HSI Ready Interrupt Flag */
#define LL_RCC_CIFR_HSERDYF                RCC_CIFR_HSERDYF      /*!< HSE Ready Interrupt Flag */
#define LL_RCC_CIFR_HSI48RDYF              RCC_CIFR_HSI48RDYF    /*!< HSI48 Ready Interrupt Flag */
#define LL_RCC_CIFR_MSIPLL1RDYF            RCC_CIFR_MSIPLL1RDYF  /*!< MSIRC1 PLL-mode ready Interrupt Flag */
#define LL_RCC_CIFR_MSIPLL0RDYF            RCC_CIFR_MSIPLL0RDYF  /*!< MSIRC0 PLL-mode ready Interrupt Flag */
#define LL_RCC_CIFR_MSIPLLUF               RCC_CIFR_MSIPLLUF     /*!< MSI PLL-mode with LSE unlock Interrupt Flag */
#define LL_RCC_CIFR_MSIPLLHSUF             RCC_CIFR_MSIPLLHSUF   /*!< MSI PLL-mode with HSE unlock Interrupt Flag */
#define LL_RCC_CIFR_CSSF                   RCC_CIFR_CSSF         /*!< Clock security system Interrupt Flag */
#define LL_RCC_CIFR_MSIKRDYF               RCC_CIFR_MSIKRDYF     /*!< MSIK oscillator Ready Interrupt Flag */
#define LL_RCC_CIFR_LSECSSF                RCC_CIFR_LSECSSF      /*!< LSE Clock security system Interrupt Flag */
/**
  * @}
  */


/** @defgroup RCC_LL_EC_LSEDRIVE  LSE oscillator drive capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW                0U                     /*!< Xtal mode lower driving capability       */
#define LL_RCC_LSEDRIVE_MEDIUMLOW          RCC_BDCR_LSEDRV_0      /*!< Xtal mode medium low driving capability  */
#define LL_RCC_LSEDRIVE_MEDIUMHIGH         RCC_BDCR_LSEDRV_1      /*!< Xtal mode medium high driving capability */
#define LL_RCC_LSEDRIVE_HIGH               RCC_BDCR_LSEDRV        /*!< Xtal mode higher driving capability      */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSCO_CLKSOURCE  LSCO Selection
  * @{
  */
#define LL_RCC_LSCO_CLKSOURCE_LSI          0U                     /*!< LSI selection for low speed clock  */
#define LL_RCC_LSCO_CLKSOURCE_LSE          RCC_BDCR_LSCOSEL       /*!< LSE selection for low speed clock  */
/**
  * @}
  */


