stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/** @defgroup RCC_LL_EC_SYS_CLKSOURCE  System clock switch
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_MSIS          0U                                  /*!< MSIS selection as system clock    */
#define LL_RCC_SYS_CLKSOURCE_HSI16         RCC_CFGR1_SW_0                      /*!< HSI16 selection as system clock   */
#define LL_RCC_SYS_CLKSOURCE_HSE           RCC_CFGR1_SW_1                      /*!< HSE selection as system clock     */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYS_CLKSOURCE_STATUS  System clock switch status
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_STATUS_MSIS          0U                           /*!< MSIS used as system clock    */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSI16         RCC_CFGR1_SWS_0              /*!< HSI16 used as system clock   */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSE           RCC_CFGR1_SWS_1              /*!< HSE used as system clock     */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_DIV  AHB prescaler
  * @{
  */
#define LL_RCC_HCLK_SYSCLK_DIV_1                0U                                                                          /*!< SYSCLK not divided    */
#define LL_RCC_HCLK_SYSCLK_DIV_2                RCC_CFGR2_HPRE_3                                                            /*!< SYSCLK divided by 2   */
#define LL_RCC_HCLK_SYSCLK_DIV_4                (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_0)                                       /*!< SYSCLK divided by 4   */
#define LL_RCC_HCLK_SYSCLK_DIV_8                (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1)                                       /*!< SYSCLK divided by 8   */
#define LL_RCC_HCLK_SYSCLK_DIV_16               (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0)                    /*!< SYSCLK divided by 16  */
#define LL_RCC_HCLK_SYSCLK_DIV_64               (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2)                                       /*!< SYSCLK divided by 64  */
#define LL_RCC_HCLK_SYSCLK_DIV_128              (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_0)                    /*!< SYSCLK divided by 128 */
#define LL_RCC_HCLK_SYSCLK_DIV_256              (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1)                    /*!< SYSCLK divided by 256 */
#define LL_RCC_HCLK_SYSCLK_DIV_512              (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0) /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB1_DIV  APB1 prescaler
  * @{
  */
#define LL_RCC_APB1_HCLK_DIV_1                  0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB1_HCLK_DIV_2                  RCC_CFGR2_PPRE1_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB1_HCLK_DIV_4                  (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB1_HCLK_DIV_8                  (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB1_HCLK_DIV_16                 (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB2_DIV  APB2 prescaler
  * @{
  */
#define LL_RCC_APB2_HCLK_DIV_1                  0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB2_HCLK_DIV_2                  RCC_CFGR2_PPRE2_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB2_HCLK_DIV_4                  (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB2_HCLK_DIV_8                  (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB2_HCLK_DIV_16                 (RCC_CFGR2_PPRE2_2 | RCC_CFGR2_PPRE2_1 | RCC_CFGR2_PPRE2_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB3_DIV  APB3 prescaler
  * @{
  */
#define LL_RCC_APB3_HCLK_DIV_1                  0U                                                          /*!< HCLK not divided   */
#define LL_RCC_APB3_HCLK_DIV_2                  RCC_CFGR3_PPRE3_2                                           /*!< HCLK divided by 2  */
#define LL_RCC_APB3_HCLK_DIV_4                  (RCC_CFGR3_PPRE3_2 | RCC_CFGR3_PPRE3_0)                     /*!< HCLK divided by 4  */
#define LL_RCC_APB3_HCLK_DIV_8                  (RCC_CFGR3_PPRE3_2 | RCC_CFGR3_PPRE3_1)                     /*!< HCLK divided by 8  */
#define LL_RCC_APB3_HCLK_DIV_16                 (RCC_CFGR3_PPRE3_2 | RCC_CFGR3_PPRE3_1 | RCC_CFGR3_PPRE3_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCOSOURCE  MCO SOURCE selection
  * @{
  */
#define LL_RCC_MCOSOURCE_NOCLOCK          0U                                                                                 /*!< MCO output disabled, no clock on MCO */
#define LL_RCC_MCOSOURCE_SYSCLK           RCC_CFGR1_MCOSEL_0                                                                 /*!< SYSCLK selection as MCO source      */
#define LL_RCC_MCOSOURCE_MSIS             RCC_CFGR1_MCOSEL_1                                                                 /*!< MSIS selection as MCO source        */
#define LL_RCC_MCOSOURCE_HSI16            (RCC_CFGR1_MCOSEL_0 | RCC_CFGR1_MCOSEL_1)                                          /*!< HSI16 selection as MCO source       */
#define LL_RCC_MCOSOURCE_HSE              RCC_CFGR1_MCOSEL_2                                                                 /*!< HSE selection as MCO source         */
#define LL_RCC_MCOSOURCE_LSI              (RCC_CFGR1_MCOSEL_0 | RCC_CFGR1_MCOSEL_2)                                          /*!< LSI selection as MCO source         */
#define LL_RCC_MCOSOURCE_LSE              (RCC_CFGR1_MCOSEL_1| RCC_CFGR1_MCOSEL_2)                                           /*!< LSE selection as MCO source         */
#define LL_RCC_MCOSOURCE_HSI48            (RCC_CFGR1_MCOSEL_0| RCC_CFGR1_MCOSEL_1 | RCC_CFGR1_MCOSEL_2)                      /*!< HSI48 selection as MCO source       */
#define LL_RCC_MCOSOURCE_MSIK             RCC_CFGR1_MCOSEL_3                                                                 /*!< MSIK selection as MCO source        */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO_DIV  MCO prescaler
  * @{
  */
#define LL_RCC_MCO_DIV_1                  0U                                                               /*!< MCO not divided    */
#define LL_RCC_MCO_DIV_2                  RCC_CFGR1_MCOPRE_0                                               /*!< MCO divided by 2   */
#define LL_RCC_MCO_DIV_4                  RCC_CFGR1_MCOPRE_1                                               /*!< MCO divided by 4   */
#define LL_RCC_MCO_DIV_8                  (RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)                        /*!< MCO divided by 8   */
#define LL_RCC_MCO_DIV_16                 RCC_CFGR1_MCOPRE_2                                               /*!< MCO divided by 16  */
#define LL_RCC_MCO_DIV_32                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_0)                        /*!< MCO divided by 32  */
#define LL_RCC_MCO_DIV_64                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1)                        /*!< MCO divided by 64  */
#define LL_RCC_MCO_DIV_128                (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)   /*!< MCO divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2SOURCE  MCO2 SOURCE selection
  * @{
  */
#define LL_RCC_MCO2SOURCE_NOCLOCK          0U                                                                                     /*!< MCO2 output disabled, no clock on MCO2 */
#define LL_RCC_MCO2SOURCE_SYSCLK           RCC_CFGR1_MCO2SEL_0                                                                    /*!< SYSCLK selection as MCO2 source        */
#define LL_RCC_MCO2SOURCE_MSIS             RCC_CFGR1_MCO2SEL_1                                                                    /*!< MSIS selection as MCO2 source          */
#define LL_RCC_MCO2SOURCE_HSI16            (RCC_CFGR1_MCO2SEL_0 | RCC_CFGR1_MCO2SEL_1)                                            /*!< HSI16 selection as MCO2 source         */
#define LL_RCC_MCO2SOURCE_HSE              RCC_CFGR1_MCO2SEL_2                                                                    /*!< HSE selection as MCO2 source           */
#define LL_RCC_MCO2SOURCE_LSI              (RCC_CFGR1_MCO2SEL_0 | RCC_CFGR1_MCO2SEL_2)                                            /*!< LSI selection as MCO2 source           */
#define LL_RCC_MCO2SOURCE_LSE              (RCC_CFGR1_MCO2SEL_1| RCC_CFGR1_MCO2SEL_2)                                             /*!< LSE selection as MCO2 source           */
#define LL_RCC_MCO2SOURCE_HSI48            (RCC_CFGR1_MCO2SEL_0| RCC_CFGR1_MCO2SEL_1 | RCC_CFGR1_MCO2SEL_2)                       /*!< HSI48 selection as MCO2 source         */
#define LL_RCC_MCO2SOURCE_MSIK             RCC_CFGR1_MCO2SEL_3                                                                    /*!< MSIK selection as MCO2 source          */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2_DIV  MCO2 prescaler
  * @{
  */
#define LL_RCC_MCO2_DIV_1                  0U                                                                  /*!< MCO2 not divided    */
#define LL_RCC_MCO2_DIV_2                  RCC_CFGR1_MCO2PRE_0                                                 /*!< MCO2 divided by 2   */
#define LL_RCC_MCO2_DIV_4                  RCC_CFGR1_MCO2PRE_1                                                 /*!< MCO2 divided by 4   */
#define LL_RCC_MCO2_DIV_8                  (RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0)                         /*!< MCO2 divided by 8   */
#define LL_RCC_MCO2_DIV_16                 RCC_CFGR1_MCO2PRE_2                                                 /*!< MCO2 divided by 16  */
#define LL_RCC_MCO2_DIV_32                 (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_0)                         /*!< MCO2 divided by 32  */
#define LL_RCC_MCO2_DIV_64                 (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1)                         /*!< MCO2 divided by 64  */
#define LL_RCC_MCO2_DIV_128                (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0)   /*!< MCO2 divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_STOP_WAKEUP_CLK  Stop wakeup clock
  * @{
  */
#define LL_RCC_STOP_WAKEUP_CLK_MSIS        0U                                                                  /*!< MSIS oscillator selected as wakeup from stop clock and CSS backup clock    */
#define LL_RCC_STOP_WAKEUP_CLK_HSI16       RCC_CFGR1_STOPWUCK                                                  /*!< HSI16 oscillator selected as wakeup from stop clock and CSS backup clock   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_STOP_WAKEUP_KERCLK  Stop wakeup kernel clock
  * @{
  */
#define LL_RCC_STOP_WAKEUP_KERCLK_MSIK        0U                                                               /*!< MSIK oscillator selected as wakeup from stop kernel clock    */
#define LL_RCC_STOP_WAKEUP_KERCLK_HSI16       RCC_CFGR1_STOPKERWUCK                                            /*!< HSI16 oscillator selected as wakeup from stop kernel clock   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RCx_PLL_INPUT_CLK  RCx PLL input clock
  * @{
  */
#define LL_RCC_MSIRCx_PLLMODE_INPUT_HSE         0U                                                              /*!< HSE (16 MHz) is used as MSI input clock when PLL-mode with high-speed clock is selected    */
#define LL_RCC_MSIRCx_PLLMODE_INPUT_HSE_DIV_2   RCC_ICSCR1_MSIHSINDIV                                           /*!< HSE (32 MHz) /2 is used as MSI input clock when PLL-mode with high-speed clock is selected */

