stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
#define LL_RCC_MSIPLL0SEL_LSE                   0U                                                              /*!< LSE is used as MSIRC0 input clock when PLL-mode is selected                */
#define LL_RCC_MSIPLL0SEL_HSE_OR_HSEDIV2        RCC_ICSCR1_MSIPLL0SEL                                           /*!< HSE or HSE/2 is used as MSIRC0 input clock when PLL-mode is selected       */

#define LL_RCC_MSIPLL1SEL_LSE                   0U                                                              /*!< LSE is used as MSIRC1 input clock when PLL-mode is selected                */
#define LL_RCC_MSIPLL1SEL_HSE_OR_HSEDIV2        RCC_ICSCR1_MSIPLL1SEL                                           /*!< HSE or HSE/2 is used as MSIRC1 input clock when PLL-mode is selected       */

#define LL_RCC_MSIPLL0_STARTUP_NORMAL           0U                                                              /*!< MSIRC0 PLL mode normal startup                */
#define LL_RCC_MSIPLL0_STARTUP_FAST             RCC_CR_MSIPLL0FAST                                              /*!< MSIRC0 PLL mode fast startup                  */

#define LL_RCC_MSIPLL1_STARTUP_NORMAL           0U                                                              /*!< MSIRC1 PLL mode normal startup                */
#define LL_RCC_MSIPLL1_STARTUP_FAST             RCC_CR_MSIPLL1FAST                                              /*!< MSIRC1 PLL mode fast startup                  */

/**
  * @}
  */

#define LL_RCC_MSI_CLOCK_RANGE_MSIXDIVS         0U                                                              /*!< MSIS/MSIK ranges provided by MSISSRANGE[3:0] and MSIKSRANGE[3:0] in RCC_CSR          */
#define LL_RCC_MSI_CLOCK_RANGE_MSIXDIV          RCC_ICSCR1_MSIRGSEL                                             /*!< MSIS/MSIK ranges provided by MSISRANGE[3:0] and MSIKRANGE[3:0] in RCC_ICSCR1         */

#define LL_RCC_MSI_BIAS_MODE_CONTINUOUS         0U                                                              /*!< MSI bias continuous mode (clock accuracy fast settling time)                         */
#define LL_RCC_MSI_BIAS_MODE_SAMPLING           RCC_ICSCR1_MSIBIAS                                              /*!< MSI bias sampling mode when the device is in Stop 1 or Stop 2 (ultra-low-power mode) */

#define LL_RCC_MSIS_CLOCK_SOURCE_RC0            0U                                                              /*!< MSIRC0 (96 MHz)  is selected as source to generate MSISSRANGE                        */
#define LL_RCC_MSIS_CLOCK_SOURCE_RC1            RCC_ICSCR1_MSISSEL                                              /*!< MSIRC1 (24 MHz)  is selected as source to generate MSISSRANGE                        */

#define LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1       0U                                                              /*!< MSIRCx /1 is selected for MSIS (RC0 : range 0 around 96 MHz / RC1 : range 4 around 24 MHz) */
#define LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2       RCC_ICSCR1_MSISDIV_0                                            /*!< MSIRCx /2 is selected for MSIS (RC0 : range 0 around 48 MHz / RC1 : range 4 around 12 MHz) */
#define LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4       RCC_ICSCR1_MSISDIV_1                                            /*!< MSIRCx /4 is selected for MSIS (RC0 : range 0 around 24 MHz / RC1 : range 4 around 6 MHz)  */
#define LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8       (RCC_ICSCR1_MSISDIV_1 | RCC_ICSCR1_MSISDIV_0)                   /*!< MSIRCx /8 is selected for MSIS (RC0 : range 0 around 12 MHz / RC1 : range 4 around 3 MHz)  */

#define LL_RCC_MSIK_CLOCK_SOURCE_RC0            0U                                                              /*!< MSIRC0 (96 MHz)  is selected as source to generate MSIKSRANGE                        */
#define LL_RCC_MSIK_CLOCK_SOURCE_RC1            RCC_ICSCR1_MSIKSEL                                              /*!< MSIRC1 (24 MHz)  is selected as source to generate MSIKSRANGE                        */

#define LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1       0U                                                              /*!< MSIRCx /1 is selected for MSIK (RC0 : range 0 around 96 MHz / RC1 : range 4 around 24 MHz) */
#define LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2       RCC_ICSCR1_MSIKDIV_0                                            /*!< MSIRCx /2 is selected for MSIK (RC0 : range 0 around 48 MHz / RC1 : range 4 around 12 MHz) */
#define LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4       RCC_ICSCR1_MSIKDIV_1                                            /*!< MSIRCx /4 is selected for MSIK (RC0 : range 0 around 24 MHz / RC1 : range 4 around 6 MHz)  */
#define LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8       (RCC_ICSCR1_MSIKDIV_1 | RCC_ICSCR1_MSIKDIV_0)                   /*!< MSIRCx /8 is selected for MSIK (RC0 : range 0 around 12 MHz / RC1 : range 4 around 3 MHz)  */

#define LL_RCC_MSIRC1_PLLMODE_LSE_MULT_732 0U                                                         /*!< Freq MSIRC1 = 23.9862 MHz */
#define LL_RCC_MSIRC1_PLLMODE_LSE_MULT_689 RCC_ICSCR1_MSIPLL1N_1                                      /*!< Freq MSIRC1 = 22.5772 MHz */
#define LL_RCC_MSIRC1_PLLMODE_LSE_MULT_750 (RCC_ICSCR1_MSIPLL1N_1 | RCC_ICSCR1_MSIPLL1N_0)            /*!< Freq MSIRC1 = 24.576 MHz  */

#define LL_RCC_HSE_ANALOG_MODE             0U
#define LL_RCC_HSE_DIGITAL_MODE            RCC_CR_HSEEXT


/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE              ((RCC_BDCR_RTCSEL_Pos << 16U) | ((RCC_BDCR_RTCSEL_Msk >> RCC_BDCR_RTCSEL_Pos) << 8U))  /*!< Mask to get RTCSEL clock source      */

#define LL_RCC_RTC_CLKSOURCE_NONE          0U                                             /*!< No clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSE           RCC_BDCR_RTCSEL_0                              /*!< LSE oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSI           RCC_BDCR_RTCSEL_1                              /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV32     (RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0)        /*!< HSE oscillator clock divided by 32 used as RTC clock */


