stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
#define IS_LL_RCC_RTC_CLKSOURCE(__VALUE__)  ((__VALUE__) == LL_RCC_RTC_CLKSOURCE)

/**
  * @}
  */


/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_LSI_PREDIV_NONE          0U                       /*!< LSI not divided */
#define LL_RCC_LSI_PREDIV_128           RCC_CSR_LSIPREDIV        /*!< LSI divided by 128 */
/**
  * @}
  */


/* Since CCIPR features are split into 3 registers, addressing is performed using following protocol:
   bits[25-24] : register_id (values RCC_OFFSET_CCIPR1/RCC_OFFSET_CCIPR2/RCC_OFFSET_CCIPR3)
   bits[20-16] : position of the field in the register
   bits[15-8]  : mask of the field in the register
   bits[7-0]   : value
   */


/** @defgroup RCC_LL_EC_UxART Peripheral UxARTx get clock source
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE         ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_USART1SEL_Pos << 16U) | ((RCC_CCIPR1_USART1SEL_Msk >> RCC_CCIPR1_USART1SEL_Pos) << 8U))  /*!< Mask to get USART1SEL clock source      */
#if defined(USART2)
#define LL_RCC_USART2_CLKSOURCE         ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_USART2SEL_Pos << 16U) | ((RCC_CCIPR2_USART2SEL_Msk >> RCC_CCIPR2_USART2SEL_Pos) << 8U))  /*!< Mask to get USART2SEL clock source      */
#endif /* USART2 */
#define LL_RCC_USART3_CLKSOURCE         ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_USART3SEL_Pos << 16U) | ((RCC_CCIPR1_USART3SEL_Msk >> RCC_CCIPR1_USART3SEL_Pos) << 8U))  /*!< Mask to get USART3SEL clock source      */
#define LL_RCC_UART4_CLKSOURCE          ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_UART4SEL_Pos << 16U) | ((RCC_CCIPR1_UART4SEL_Msk >> RCC_CCIPR1_UART4SEL_Pos) << 8U))     /*!< Mask to get UART4SEL clock source      */
#define LL_RCC_UART5_CLKSOURCE          ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_UART5SEL_Pos << 16U) | ((RCC_CCIPR1_UART5SEL_Msk >> RCC_CCIPR1_UART5SEL_Pos) << 8U))     /*!< Mask to get UART5SEL clock source      */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_UxART_CLKSOURCE  Peripheral UxARTx clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK2   (LL_RCC_USART1_CLKSOURCE | 0U)                                                                                                    /*!< PCLK2 clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_HSI16   (LL_RCC_USART1_CLKSOURCE | (RCC_CCIPR1_USART1SEL >> RCC_CCIPR1_USART1SEL_Pos))                                                    /*!< HSI16 clock used as USART1 clock source */

#if defined(USART2)
#define LL_RCC_USART2_CLKSOURCE_PCLK1   (LL_RCC_USART2_CLKSOURCE | 0U)                                                                                                    /*!< PCLK1 clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_HSI16   (LL_RCC_USART2_CLKSOURCE | (RCC_CCIPR2_USART2SEL >> RCC_CCIPR2_USART2SEL_Pos))                                                    /*!< HSI16 clock used as USART2 clock source */
#endif /* USART2 */

#define LL_RCC_USART3_CLKSOURCE_PCLK1   (LL_RCC_USART3_CLKSOURCE | 0U)                                                                                                    /*!< PCLK1 clock used as USART3 clock source */
#define LL_RCC_USART3_CLKSOURCE_HSI16   (LL_RCC_USART3_CLKSOURCE | (RCC_CCIPR1_USART3SEL >> RCC_CCIPR1_USART3SEL_Pos))                                                    /*!< HSI16 clock used as USART3 clock source */

#define LL_RCC_UART4_CLKSOURCE_PCLK1   (LL_RCC_UART4_CLKSOURCE | 0U)                                                                                                      /*!< PCLK1 clock used as UART4 clock source */
#define LL_RCC_UART4_CLKSOURCE_HSI16   (LL_RCC_UART4_CLKSOURCE | (RCC_CCIPR1_UART4SEL >> RCC_CCIPR1_UART4SEL_Pos))                                                        /*!< HSI16 clock used as UART4 clock source */

#define LL_RCC_UART5_CLKSOURCE_PCLK1   (LL_RCC_UART5_CLKSOURCE | 0U)                                                                                                      /*!< PCLK1 clock used as UART5 clock source */
#define LL_RCC_UART5_CLKSOURCE_HSI16   (LL_RCC_UART5_CLKSOURCE | (RCC_CCIPR1_UART5SEL >> RCC_CCIPR1_UART5SEL_Pos))                                                        /*!< HSI16 clock used as UART5 clock source */
/**
  * @}
  */

#if defined(USART2)
#define IS_LL_RCC_USART_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) || \
                                               ((__VALUE__) == LL_RCC_USART2_CLKSOURCE) || \
                                               ((__VALUE__) == LL_RCC_USART3_CLKSOURCE))
#else
#define IS_LL_RCC_USART_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) || \
                                               ((__VALUE__) == LL_RCC_USART3_CLKSOURCE))
#endif /* USART2 */

#define IS_LL_RCC_UART_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_UART4_CLKSOURCE) || \
                                              ((__VALUE__) == LL_RCC_UART5_CLKSOURCE))

/** @defgroup RCC_LL_EC_I3C Peripheral I3Cx get clock source
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_I3C1SEL_Pos << 16U) | ((RCC_CCIPR1_I3C1SEL_Msk >> RCC_CCIPR1_I3C1SEL_Pos) << 8U))     /*!< Mask to get I3C1SEL clock source      */
#define LL_RCC_I3C2_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_I3C2SEL_Pos << 16U) | ((RCC_CCIPR1_I3C2SEL_Msk >> RCC_CCIPR1_I3C2SEL_Pos) << 8U))     /*!< Mask to get I3C2SEL clock source      */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_I3Cx_CLKSOURCE  Peripheral I3Cx clock source selection
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE_PCLK1     (LL_RCC_I3C1_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as I3C1 clock source */
#define LL_RCC_I3C1_CLKSOURCE_MSIK      (LL_RCC_I3C1_CLKSOURCE | (RCC_CCIPR1_I3C1SEL >> RCC_CCIPR1_I3C1SEL_Pos))                                                       /*!< MSIK clock used as I3C1 clock source  */

#define LL_RCC_I3C2_CLKSOURCE_PCLK2     (LL_RCC_I3C2_CLKSOURCE | 0U)                                                                                                   /*!< PCLK2 clock used as I3C2 clock source */
#define LL_RCC_I3C2_CLKSOURCE_MSIK      (LL_RCC_I3C2_CLKSOURCE | (RCC_CCIPR1_I3C2SEL >> RCC_CCIPR1_I3C2SEL_Pos))                                                       /*!< MSIK clock used as I3C2 clock source  */
/**
  * @}
  */

#define IS_LL_RCC_I3C_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_I3C1_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I3C2_CLKSOURCE))

/** @defgroup RCC_LL_EC_I2C Peripheral I2Cx get clock source
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_I2C1SEL_Pos << 16U) | ((RCC_CCIPR1_I2C1SEL_Msk >> RCC_CCIPR1_I2C1SEL_Pos) << 8U))     /*!< Mask to get I2C1SEL clock source       */
#define LL_RCC_I2C2_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_I2C2SEL_Pos << 16U) | ((RCC_CCIPR1_I2C2SEL_Msk >> RCC_CCIPR1_I2C2SEL_Pos) << 8U))     /*!< Mask to get I2C2SEL clock source       */
#define LL_RCC_I2C3_CLKSOURCE           ((RCC_OFFSET_CCIPR3 << 24U) | (RCC_CCIPR3_I2C3SEL_Pos << 16U) | ((RCC_CCIPR3_I2C3SEL_Msk >> RCC_CCIPR3_I2C3SEL_Pos) << 8U))     /*!< Mask to get I2C3SEL clock source       */
#if defined(I2C4)
#define LL_RCC_I2C4_CLKSOURCE           ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_I2C4SEL_Pos << 16U) | ((RCC_CCIPR2_I2C4SEL_Msk >> RCC_CCIPR2_I2C4SEL_Pos) << 8U))     /*!< Mask to get I2C4SEL clock source       */
#endif /* I2C4 */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_I2Cx_CLKSOURCE  Peripheral I2Cx clock source selection
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE_PCLK1     (LL_RCC_I2C1_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as I2C1 clock source  */
#define LL_RCC_I2C1_CLKSOURCE_MSIK      (LL_RCC_I2C1_CLKSOURCE | (RCC_CCIPR1_I2C1SEL >> RCC_CCIPR1_I2C1SEL_Pos))                                                       /*!< MSIK clock used as I2C1 clock source   */

#define LL_RCC_I2C2_CLKSOURCE_PCLK1     (LL_RCC_I2C2_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as I2C2 clock source  */
#define LL_RCC_I2C2_CLKSOURCE_MSIK      (LL_RCC_I2C2_CLKSOURCE | (RCC_CCIPR1_I2C2SEL >> RCC_CCIPR1_I2C2SEL_Pos))                                                       /*!< MSIK clock used as I2C2 clock source   */

#define LL_RCC_I2C3_CLKSOURCE_PCLK3     (LL_RCC_I2C3_CLKSOURCE | 0U)                                                                                                   /*!< PCLK3 clock used as I2C3 clock source  */
#define LL_RCC_I2C3_CLKSOURCE_MSIK      (LL_RCC_I2C3_CLKSOURCE | (RCC_CCIPR3_I2C3SEL >> RCC_CCIPR3_I2C3SEL_Pos))                                                       /*!< MSIK clock used as I2C3 clock source   */

#if defined(I2C4)
#define LL_RCC_I2C4_CLKSOURCE_PCLK1     (LL_RCC_I2C4_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as I2C4 clock source  */
#define LL_RCC_I2C4_CLKSOURCE_MSIK      (LL_RCC_I2C4_CLKSOURCE | (RCC_CCIPR2_I2C4SEL >> RCC_CCIPR2_I2C4SEL_Pos))                                                       /*!< MSIK clock used as I2C4 clock source   */
#endif /* I2C4 */
/**
  * @}
  */

#if defined(I2C4)
#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_I2C1_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I2C2_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I2C3_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I2C4_CLKSOURCE))
#else
#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_I2C1_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I2C2_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_I2C3_CLKSOURCE))
#endif /* I2C4 */

/** @defgroup RCC_LL_EC_SPI Peripheral SPIx get clock source
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_SPI1SEL_Pos << 16U) | ((RCC_CCIPR1_SPI1SEL_Msk >> RCC_CCIPR1_SPI1SEL_Pos) << 8U))     /*!< Mask to get SPI1SEL clock source       */
#define LL_RCC_SPI2_CLKSOURCE           ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_SPI2SEL_Pos << 16U) | ((RCC_CCIPR1_SPI2SEL_Msk >> RCC_CCIPR1_SPI2SEL_Pos) << 8U))     /*!< Mask to get SPI2SEL clock source       */
#define LL_RCC_SPI3_CLKSOURCE           ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_SPI3SEL_Pos << 16U) | ((RCC_CCIPR2_SPI3SEL_Msk >> RCC_CCIPR2_SPI3SEL_Pos) << 8U))     /*!< Mask to get SPI3SEL clock source       */
#if defined(SPI4)
#define LL_RCC_SPI4_CLKSOURCE           ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_SPI4SEL_Pos << 16U) | ((RCC_CCIPR2_SPI4SEL_Msk >> RCC_CCIPR2_SPI4SEL_Pos) << 8U))     /*!< Mask to get SPI4SEL clock source       */
#endif /* SPI4 */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_SPIx_CLKSOURCE  Peripheral SPIx clock source selection
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE_PCLK2     (LL_RCC_SPI1_CLKSOURCE | 0U)                                                                                                   /*!< PCLK2 clock used as SPI1 clock source  */
#define LL_RCC_SPI1_CLKSOURCE_MSIK      (LL_RCC_SPI1_CLKSOURCE | (RCC_CCIPR1_SPI1SEL >> RCC_CCIPR1_SPI1SEL_Pos))                                                       /*!< MSIK clock used as SPI1 clock source   */

#define LL_RCC_SPI2_CLKSOURCE_PCLK1     (LL_RCC_SPI2_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as SPI2 clock source  */
#define LL_RCC_SPI2_CLKSOURCE_MSIK      (LL_RCC_SPI2_CLKSOURCE | (RCC_CCIPR1_SPI2SEL >> RCC_CCIPR1_SPI2SEL_Pos))                                                       /*!< MSIK clock used as SPI2 clock source   */

#define LL_RCC_SPI3_CLKSOURCE_PCLK1     (LL_RCC_SPI3_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as SPI3 clock source  */
#define LL_RCC_SPI3_CLKSOURCE_MSIK      (LL_RCC_SPI3_CLKSOURCE | (RCC_CCIPR2_SPI3SEL >> RCC_CCIPR2_SPI3SEL_Pos))                                                       /*!< MSIK clock used as SPI3 clock source   */

#if defined(SPI4)
#define LL_RCC_SPI4_CLKSOURCE_PCLK1     (LL_RCC_SPI4_CLKSOURCE | 0U)                                                                                                   /*!< PCLK1 clock used as SPI4 clock source  */
#define LL_RCC_SPI4_CLKSOURCE_MSIK      (LL_RCC_SPI4_CLKSOURCE | (RCC_CCIPR2_SPI4SEL >> RCC_CCIPR2_SPI4SEL_Pos))                                                       /*!< MSIK clock used as SPI4 clock source   */
#endif /* SPI4 */
/**
  * @}
  */

#if defined(SPI4)
#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SPI1_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_SPI2_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_SPI3_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_SPI4_CLKSOURCE))
#else
#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SPI1_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_SPI2_CLKSOURCE) || \
                                             ((__VALUE__) == LL_RCC_SPI3_CLKSOURCE))
#endif /* SPI4 */


/** @defgroup RCC_LL_EC_LPTIM Peripheral LPTIMx get clock source
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE         ((RCC_OFFSET_CCIPR3 << 24U) | (RCC_CCIPR3_LPTIM1SEL_Pos << 16U) | ((RCC_CCIPR3_LPTIM1SEL_Msk >> RCC_CCIPR3_LPTIM1SEL_Pos) << 8U))     /*!< Mask to get LPTIM1SEL clock source       */
#define LL_RCC_LPTIM2_CLKSOURCE         ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_LPTIM2SEL_Pos << 16U) | ((RCC_CCIPR1_LPTIM2SEL_Msk >> RCC_CCIPR1_LPTIM2SEL_Pos) << 8U))     /*!< Mask to get LPTIM2SEL clock source       */
#define LL_RCC_LPTIM34_CLKSOURCE        ((RCC_OFFSET_CCIPR3 << 24U) | (RCC_CCIPR3_LPTIM34SEL_Pos << 16U) | ((RCC_CCIPR3_LPTIM34SEL_Msk >> RCC_CCIPR3_LPTIM34SEL_Pos) << 8U))  /*!< Mask to get LPTIM34SEL clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_LPTIM_CLKSOURCE  Peripheral LPTIMx clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_MSIK    (LL_RCC_LPTIM1_CLKSOURCE | 0U)                                                                                                       /*!< MSIK clock used as LPTIM1 clock source  */
#define LL_RCC_LPTIM1_CLKSOURCE_LSI     (LL_RCC_LPTIM1_CLKSOURCE | (RCC_CCIPR3_LPTIM1SEL_0 >> RCC_CCIPR3_LPTIM1SEL_Pos))                                                     /*!< LSI clock used as LPTIM1 clock source  */
#define LL_RCC_LPTIM1_CLKSOURCE_HSI16   (LL_RCC_LPTIM1_CLKSOURCE | (RCC_CCIPR3_LPTIM1SEL_1 >> RCC_CCIPR3_LPTIM1SEL_Pos))                                                     /*!< HSI16 clock used as LPTIM1 clock source    */
#define LL_RCC_LPTIM1_CLKSOURCE_LSE     (LL_RCC_LPTIM1_CLKSOURCE | ((RCC_CCIPR3_LPTIM1SEL_1 | RCC_CCIPR3_LPTIM1SEL_0) >> RCC_CCIPR3_LPTIM1SEL_Pos))                          /*!< LSE clock used as LPTIM1 clock source    */

