stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
#define LL_RCC_LPTIM2_CLKSOURCE_PCLK1   (LL_RCC_LPTIM2_CLKSOURCE | 0U)                                                                                                       /*!< PCLK1 clock used as LPTIM2 clock source  */
#define LL_RCC_LPTIM2_CLKSOURCE_LSI     (LL_RCC_LPTIM2_CLKSOURCE | (RCC_CCIPR1_LPTIM2SEL_0 >> RCC_CCIPR1_LPTIM2SEL_Pos))                                                     /*!< LSI clock used as LPTIM2 clock source  */
#define LL_RCC_LPTIM2_CLKSOURCE_HSI16   (LL_RCC_LPTIM2_CLKSOURCE | (RCC_CCIPR1_LPTIM2SEL_1 >> RCC_CCIPR1_LPTIM2SEL_Pos))                                                     /*!< HSI16 clock used as LPTIM2 clock source    */
#define LL_RCC_LPTIM2_CLKSOURCE_LSE     (LL_RCC_LPTIM2_CLKSOURCE | ((RCC_CCIPR1_LPTIM2SEL_1 | RCC_CCIPR1_LPTIM2SEL_0) >> RCC_CCIPR1_LPTIM2SEL_Pos))                          /*!< LSE clock used as LPTIM2 clock source    */

#define LL_RCC_LPTIM34_CLKSOURCE_MSIK   (LL_RCC_LPTIM34_CLKSOURCE | 0U)                                                                                                      /*!< MSIK clock used as LPTIM34 clock source  */
#define LL_RCC_LPTIM34_CLKSOURCE_LSI    (LL_RCC_LPTIM34_CLKSOURCE | (RCC_CCIPR3_LPTIM34SEL_0 >> RCC_CCIPR3_LPTIM34SEL_Pos))                                                  /*!< LSI clock used as LPTIM34 clock source  */
#define LL_RCC_LPTIM34_CLKSOURCE_HSI16  (LL_RCC_LPTIM34_CLKSOURCE | (RCC_CCIPR3_LPTIM34SEL_1 >> RCC_CCIPR3_LPTIM34SEL_Pos))                                                  /*!< HSI16 clock used as LPTIM34 clock source    */
#define LL_RCC_LPTIM34_CLKSOURCE_LSE    (LL_RCC_LPTIM34_CLKSOURCE | ((RCC_CCIPR3_LPTIM34SEL_1 | RCC_CCIPR3_LPTIM34SEL_0) >> RCC_CCIPR3_LPTIM34SEL_Pos))                      /*!< LSE clock used as LPTIM34 clock source    */
/**
  * @}
  */

#define IS_LL_RCC_LPTIM_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_LPTIM1_CLKSOURCE) || \
                                               ((__VALUE__) == LL_RCC_LPTIM2_CLKSOURCE) || \
                                               ((__VALUE__) == LL_RCC_LPTIM34_CLKSOURCE))

/** @defgroup RCC_LL_EC_LPUART Peripheral LPUARTx get clock source
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE        ((RCC_OFFSET_CCIPR3 << 24U) | (RCC_CCIPR3_LPUART1SEL_Pos << 16U) | ((RCC_CCIPR3_LPUART1SEL_Msk >> RCC_CCIPR3_LPUART1SEL_Pos) << 8U))     /*!< Mask to get LPUART clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_LPUART1_CLKSOURCE  Peripheral LPUART1 clock source selection
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK3    (LL_RCC_LPUART1_CLKSOURCE | 0U)                                                                                                       /*!< PCLK3 clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_HSI16    (LL_RCC_LPUART1_CLKSOURCE | (RCC_CCIPR3_LPUART1SEL_0 >> RCC_CCIPR3_LPUART1SEL_Pos))                                                   /*!< HSI16 clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_LSE      (LL_RCC_LPUART1_CLKSOURCE | (RCC_CCIPR3_LPUART1SEL_1 >> RCC_CCIPR3_LPUART1SEL_Pos))                                                   /*!< LSE clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_MSIK     (LL_RCC_LPUART1_CLKSOURCE | ((RCC_CCIPR3_LPUART1SEL_1 | RCC_CCIPR3_LPUART1SEL_0) >> RCC_CCIPR3_LPUART1SEL_Pos))                       /*!< MSIK clock used as LPUART1 clock source */
/**
  * @}
  */

#define IS_LL_RCC_LPUART_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_LPUART1_CLKSOURCE))

/** @defgroup RCC_LL_EC_SYSTICK Peripheral SYSTICK get clock source
  * @{
  */
#define LL_RCC_SYSTICK_CLKSOURCE        ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_SYSTICKSEL_Pos << 16U) | ((RCC_CCIPR1_SYSTICKSEL_Msk >> RCC_CCIPR1_SYSTICKSEL_Pos) << 8U))     /*!< Mask to get SYSTICK clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_SYSTICK_CLKSOURCE Peripheral SYSTICK clock source selection
  * @{
  */
#define LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8  (LL_RCC_SYSTICK_CLKSOURCE | 0U )                                                                                                       /*!< HCLKDIV8 clock used as SYSTICK clock source */
#define LL_RCC_SYSTICK_CLKSOURCE_LSI       (LL_RCC_SYSTICK_CLKSOURCE | (RCC_CCIPR1_SYSTICKSEL_0 >> RCC_CCIPR1_SYSTICKSEL_Pos))                                                  /*!< LSI clock used as SYSTICK clock source      */
#define LL_RCC_SYSTICK_CLKSOURCE_LSE       (LL_RCC_SYSTICK_CLKSOURCE | (RCC_CCIPR1_SYSTICKSEL_1 >> RCC_CCIPR1_SYSTICKSEL_Pos))                                                  /*!< LSE clock used as SYSTICK clock source      */
/**
  * @}
  */

#define IS_LL_RCC_SYSTICK_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SYSTICK_CLKSOURCE))

/** @defgroup RCC_LL_EC_FDCAN Peripheral FDCAN get clock source
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE          ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_FDCANSEL_Pos << 16U) | ((RCC_CCIPR1_FDCANSEL_Msk >> RCC_CCIPR1_FDCANSEL_Pos) << 8U))       /*!< Mask to get FDCAN clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_FDCAN_CLKSOURCE Peripheral FDCAN clock source selection
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE_SYSCLK   (LL_RCC_FDCAN_CLKSOURCE | 0U)                                                                                                        /*!< SYSCLK clock used as FDCAN clock source */
#define LL_RCC_FDCAN_CLKSOURCE_MSIK     (LL_RCC_FDCAN_CLKSOURCE | (RCC_CCIPR1_FDCANSEL >> RCC_CCIPR1_FDCANSEL_Pos))                                                        /*!< MSIK clock used as FDCAN clock source    */
/**
  * @}
  */

#define IS_LL_RCC_FDCAN_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_FDCAN_CLKSOURCE))

/** @defgroup RCC_LL_EC_ICLK Peripheral ICLK get clock source
  * @{
  */
#define LL_RCC_ICLK_CLKSOURCE            ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_ICLKSEL_Pos << 16U) | ((RCC_CCIPR1_ICLKSEL_Msk >> RCC_CCIPR1_ICLKSEL_Pos) << 8U))            /*!< Mask to get ICLK clock source       */
#define LL_RCC_SDMMC1_CLKSOURCE          LL_RCC_ICLK_CLKSOURCE
/**
  * @}
  */
/** @defgroup RCC_LL_EC_ICLK_CLKSOURCE Peripheral ICLK clock source selection
  * @{
  */
#define LL_RCC_ICLK_CLKSOURCE_HSI48      (LL_RCC_ICLK_CLKSOURCE | 0U)                                                                                                          /*!< HSI48 clock used as ICLK clock source   */
#define LL_RCC_ICLK_CLKSOURCE_MSIK       (LL_RCC_ICLK_CLKSOURCE | (RCC_CCIPR1_ICLKSEL_0 >> RCC_CCIPR1_ICLKSEL_Pos))                                                            /*!< MSIK clock used as ICLK clock source    */
#define LL_RCC_ICLK_CLKSOURCE_HSE        (LL_RCC_ICLK_CLKSOURCE | (RCC_CCIPR1_ICLKSEL_1 >> RCC_CCIPR1_ICLKSEL_Pos))                                                            /*!< HSE clock used as ICLK clock source     */
#define LL_RCC_ICLK_CLKSOURCE_SYSCLK     (LL_RCC_ICLK_CLKSOURCE | ((RCC_CCIPR1_ICLKSEL_1 | RCC_CCIPR1_ICLKSEL_0) >> RCC_CCIPR1_ICLKSEL_Pos))                                   /*!< SYSCLK clock used as ICLK clock source  */
/**
  * @}
  */

#define IS_LL_RCC_ICLK_CLKSOURCE(__VALUE__)   (((__VALUE__) == LL_RCC_ICLK_CLKSOURCE))
#define IS_LL_RCC_SDMMC_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SDMMC1_CLKSOURCE))

/** @defgroup RCC_LL_EC_USB1 Peripheral USB1 get clock source
  * @{
  */
#define LL_RCC_USB1_CLKSOURCE            ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_USB1SEL_Pos << 16U) | ((RCC_CCIPR1_USB1SEL_Msk >> RCC_CCIPR1_USB1SEL_Pos) << 8U))            /*!< Mask to get USB1 clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_USB1_USB1SOURCE Peripheral USB1 clock source selection
  * @{
  */
#define LL_RCC_USB1_CLKSOURCE_ICLK           (LL_RCC_USB1_CLKSOURCE | 0U)                                                                                                      /*!< ICLK clock used as USB1 clock source */
#define LL_RCC_USB1_CLKSOURCE_ICLKDIV2       (LL_RCC_USB1_CLKSOURCE | (RCC_CCIPR1_USB1SEL >> RCC_CCIPR1_USB1SEL_Pos))                                                          /*!< ICLK/2 clock used as USB1 clock source    */
/**
  * @}
  */

#define IS_LL_RCC_USB_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_USB1_CLKSOURCE))

/** @defgroup RCC_LL_EC_TIMIC Peripheral TIMIC get clock source
  * @{
  */
#define LL_RCC_TIMIC_CLKSOURCE            ((RCC_OFFSET_CCIPR1 << 24U) | (RCC_CCIPR1_TIMICSEL_Pos << 16U) | ((RCC_CCIPR1_TIMICSEL_Msk >> RCC_CCIPR1_TIMICSEL_Pos) << 8U))        /*!< Mask to get TIMIC clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_TIM_INPUT_CAPTURE_CLOCKSource Peripheral TIMIC clock source selection
  * @{
  */
#define LL_RCC_TIMIC_CLKSOURCE_NONE                           (LL_RCC_TIMIC_CLKSOURCE | 0U)                                                                                                       /*!< No clock available for TIM16/TIM17 and LPTIM2 input capture */
#define LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSISDIV4 (LL_RCC_TIMIC_CLKSOURCE | (RCC_CCIPR1_TIMICSEL_2 >> RCC_CCIPR1_TIMICSEL_Pos))                                                       /*!< HSI/256, MSIS/1024 and MSIS/4 generated and can be selected for TIM16/TIM17 and LPTIM2 input capture */
#define LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSIKDIV4 (LL_RCC_TIMIC_CLKSOURCE | ((RCC_CCIPR1_TIMICSEL_2 | RCC_CCIPR1_TIMICSEL_0) >> RCC_CCIPR1_TIMICSEL_Pos))                             /*!< HSI/256, MSIS/1024 and MSIK/4 generated and can be selected for TIM16/TIM17 and LPTIM2 input capture */
#define LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSISDIV4 (LL_RCC_TIMIC_CLKSOURCE | ((RCC_CCIPR1_TIMICSEL_2 | RCC_CCIPR1_TIMICSEL_1) >> RCC_CCIPR1_TIMICSEL_Pos))                             /*!< HSI/256, MSIK/1024 and MSIS/4 generated and can be selected for TIM16/TIM17 and LPTIM2 input capture */
#define LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSIKDIV4 (LL_RCC_TIMIC_CLKSOURCE | ((RCC_CCIPR1_TIMICSEL_2 | RCC_CCIPR1_TIMICSEL_1 | RCC_CCIPR1_TIMICSEL_0) >> RCC_CCIPR1_TIMICSEL_Pos))     /*!< HSI/256, MSIK/1024 and MSIK/4 generated and can be selected for TIM16/TIM17 and LPTIM2 input capture */
/**
  * @}
  */

#define IS_LL_RCC_TIMIC_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_TIMIC_CLKSOURCE))

