stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/** @defgroup RCC_LL_EC_ADF1 Peripheral ADF1 get clock source
  * @{
  */
#define LL_RCC_ADF1_CLKSOURCE             ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_ADF1SEL_Pos << 16U) | ((RCC_CCIPR2_ADF1SEL_Msk >> RCC_CCIPR2_ADF1SEL_Pos) << 8U))           /*!< Mask to get ADF1 clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_ADF1_CLKSOURCE  Peripheral ADF1 clock source selection
  * @{
  */
#define LL_RCC_ADF1_CLKSOURCE_SAI1       (LL_RCC_ADF1_CLKSOURCE | 0U)                                                                                                           /*!< SAI1 clock used as ADF1 clock source */
#define LL_RCC_ADF1_CLKSOURCE_AUDCLKIN   (LL_RCC_ADF1_CLKSOURCE | (RCC_CCIPR2_ADF1SEL_0 >> RCC_CCIPR2_ADF1SEL_Pos))                                                             /*!< input pin AUDIOCLK clock used as ADF1 clock source */
#define LL_RCC_ADF1_CLKSOURCE_MSIK       (LL_RCC_ADF1_CLKSOURCE | (RCC_CCIPR2_ADF1SEL_1 >> RCC_CCIPR2_ADF1SEL_Pos))                                                             /*!< MSIK clock used as ADF1 clock source */
/**
  * @}
  */

#define IS_LL_RCC_ADF_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_ADF1_CLKSOURCE))

/** @defgroup RCC_LL_EC_SAI1 Peripheral SAI1 get clock source
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE             ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_SAI1SEL_Pos << 16U) | ((RCC_CCIPR2_SAI1SEL_Msk >> RCC_CCIPR2_SAI1SEL_Pos) << 8U))           /*!< Mask to get SAI1 clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_SAI1_CLKSOURCE  Peripheral SAI1 clock source selection
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE_MSIK        (LL_RCC_SAI1_CLKSOURCE | 0U)                                                                                                         /*!< MSIK clock used as SAI1 clock source */
#define LL_RCC_SAI1_CLKSOURCE_AUDCLKIN    (LL_RCC_SAI1_CLKSOURCE | (RCC_CCIPR2_SAI1SEL_0 >> RCC_CCIPR2_SAI1SEL_Pos))                                                           /*!< External input clock used as SAI1 clock source */
#define LL_RCC_SAI1_CLKSOURCE_HSE         (LL_RCC_SAI1_CLKSOURCE | (RCC_CCIPR2_SAI1SEL_1>> RCC_CCIPR2_SAI1SEL_Pos))                                                            /*!< HSE clock used as SAI1 clock source */
/**
  * @}
  */

#define IS_LL_RCC_SAI_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SAI1_CLKSOURCE))

/** @defgroup RCC_LL_EC_RNG Peripheral RNG get clock source
  * @{
  */
#define LL_RCC_RNG_CLKSOURCE              ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_RNGSEL_Pos << 16U) | ((RCC_CCIPR2_RNGSEL_Msk >> RCC_CCIPR2_RNGSEL_Pos) << 8U))              /*!< Mask to get RNG clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_RNG_CLKSOURCE  Peripheral RNG clock source selection
  * @{
  */
#define LL_RCC_RNG_CLKSOURCE_HSI48        (LL_RCC_RNG_CLKSOURCE | 0U)                                                                                                          /*!< HSI48 clock used as RNG clock source */
#define LL_RCC_RNG_CLKSOURCE_MSIK         (LL_RCC_RNG_CLKSOURCE | (RCC_CCIPR2_RNGSEL >> RCC_CCIPR2_RNGSEL_Pos))                                                                /*!< MSIK clock used as RNG clock source */
/**
  * @}
  */

#define IS_LL_RCC_RNG_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_RNG_CLKSOURCE))

/** @defgroup RCC_LL_EC_ADCDAC_CLKPRESCALER Peripheral ADCDAC get kernel clock prescaler
  * @{
  */
#define LL_RCC_ADCDAC_CLKPRESCALER        ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_ADCDACPRE_Pos << 16U) | ((RCC_CCIPR2_ADCDACPRE_Msk >> RCC_CCIPR2_ADCDACPRE_Pos) << 8U))    /*!< Mask to get ADCDAC kernel clock prescaler  */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_ADCDAC_CLKPRESCALER_SELECTION  Peripheral ADCDAC clock prescaler selection
  * @{
  */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK             (LL_RCC_ADCDAC_CLKPRESCALER | 0U)                                                                                                                                /*!< ICLK clock used as ADCDAC clock prescaler     */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_2       (LL_RCC_ADCDAC_CLKPRESCALER | (RCC_CCIPR2_ADCDACPRE_0 >> RCC_CCIPR2_ADCDACPRE_Pos))                                                                              /*!< ICLK/2 clock used as ADCDAC clock prescaler   */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_4       (LL_RCC_ADCDAC_CLKPRESCALER | (RCC_CCIPR2_ADCDACPRE_3 >> RCC_CCIPR2_ADCDACPRE_Pos))                                                                              /*!< ICLK/4 clock used as ADCDAC clock prescaler   */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_8       (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_0) >> RCC_CCIPR2_ADCDACPRE_Pos))                                                   /*!< ICLK/8 clock used as ADCDAC clock prescaler   */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_16      (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_1) >> RCC_CCIPR2_ADCDACPRE_Pos))                                                   /*!< ICLK/16 clock used as ADCDAC clock prescaler  */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_32      (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0) >> RCC_CCIPR2_ADCDACPRE_Pos))                          /*!< ICLK/32 clock used as ADCDAC clock prescaler  */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_64      (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2) >> RCC_CCIPR2_ADCDACPRE_Pos))                                                   /*!< ICLK/64 clock used as ADCDAC clock prescaler  */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_128     (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_0) >> RCC_CCIPR2_ADCDACPRE_Pos))                          /*!< ICLK/128 clock used as ADCDAC clock prescaler */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_256     (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1) >> RCC_CCIPR2_ADCDACPRE_Pos))                          /*!< ICLK/256 clock used as ADCDAC clock prescaler */
#define LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_512     (LL_RCC_ADCDAC_CLKPRESCALER | ((RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0) >> RCC_CCIPR2_ADCDACPRE_Pos)) /*!< ICLK/512 clock used as ADCDAC clock prescaler */
/**
  * @}
  */

