stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/** @defgroup RCC_LL_EC_ADCDAC Peripheral ADCDAC get clock source
  * @{
  */
#define LL_RCC_ADCDAC_CLKSOURCE            ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_ADCDACSEL_Pos << 16U) | ((RCC_CCIPR2_ADCDACSEL_Msk >> RCC_CCIPR2_ADCDACSEL_Pos) << 8U))    /*!< Mask to get ADCDAC clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_ADCDAC_CLKSOURCE  Peripheral ADCDAC clock source selection
  * @{
  */
#define LL_RCC_ADCDAC_CLKSOURCE_HCLK       (LL_RCC_ADCDAC_CLKSOURCE | 0U)                                                                                                      /*!< HCLK clock used as ADCDAC clock source */
#define LL_RCC_ADCDAC_CLKSOURCE_HSE        (LL_RCC_ADCDAC_CLKSOURCE | (RCC_CCIPR2_ADCDACSEL_0 >> RCC_CCIPR2_ADCDACSEL_Pos))                                                    /*!< HSE clock used as ADCDAC clock source */
#define LL_RCC_ADCDAC_CLKSOURCE_MSIK       (LL_RCC_ADCDAC_CLKSOURCE | (RCC_CCIPR2_ADCDACSEL_1 >> RCC_CCIPR2_ADCDACSEL_Pos))                                                    /*!< MSI clock used as ADCDAC clock source */
/**
  * @}
  */

#define IS_LL_RCC_ADCDAC_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_ADCDAC_CLKSOURCE))

/** @defgroup RCC_LL_EC_DAC1 Peripheral DAC1 get clock source
  * @{
  */
#define LL_RCC_DAC1SH_CLKSOURCE           ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_DAC1SHSEL_Pos << 16U) | ((RCC_CCIPR2_DAC1SHSEL_Msk >> RCC_CCIPR2_DAC1SHSEL_Pos) << 8U))   /*!< Mask to get DAC1 sample & hold clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_DAC1SH_CLKSOURCE  Peripheral DAC1 sample & hold clock source selection
  * @{
  */
#define LL_RCC_DAC1SH_CLKSOURCE_LSE       (LL_RCC_DAC1SH_CLKSOURCE | 0U)                                                                                                         /*!< LSE clock used as DAC1 clock source */
#define LL_RCC_DAC1SH_CLKSOURCE_LSI       (LL_RCC_DAC1SH_CLKSOURCE | (RCC_CCIPR2_DAC1SHSEL >> RCC_CCIPR2_DAC1SHSEL_Pos))                                                         /*!< LSI clock used as DAC1 clock source */
/**
  * @}
  */

#define IS_LL_RCC_DAC1SH_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_DAC1SH_CLKSOURCE))

/** @defgroup RCC_LL_EC_OCTOSPI Peripheral OCTOSPI get clock source
  * @{
  */
#define LL_RCC_OCTOSPI_CLKSOURCE          ((RCC_OFFSET_CCIPR2 << 24U) | (RCC_CCIPR2_OCTOSPISEL_Pos << 16U) | ((RCC_CCIPR2_OCTOSPISEL_Msk >> RCC_CCIPR2_OCTOSPISEL_Pos) << 8U))  /*!< Mask to get OCTOSPI clock source       */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_OCTOSPI_CLKSOURCE  Peripheral OCTOSPI clock source selection
  * @{
  */
#define LL_RCC_OCTOSPI_CLKSOURCE_SYSCLK   (LL_RCC_OCTOSPI_CLKSOURCE | 0U)                                                                                                      /*!< SYSCLK clock used as OCTOSPI clock source */
#define LL_RCC_OCTOSPI_CLKSOURCE_MSIK     (LL_RCC_OCTOSPI_CLKSOURCE | (RCC_CCIPR2_OCTOSPISEL>> RCC_CCIPR2_OCTOSPISEL_Pos))                                                     /*!< MSIK clock used as OCTOSPI clock source */
/**
  * @}
  */

#define IS_LL_RCC_OCTOSPI_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_OCTOSPI_CLKSOURCE))


/** @defgroup RCC_LL_EC_EPODBOOST_CLKSOURCE  EPOD clock source selection
  * @{
  */
#define LL_RCC_EPODBOOSTCLKSRCE_BYPASS          0U
#define LL_RCC_EPODBOOSTCLKSRCE_MSIS            RCC_CFGR4_BOOSTSEL_0
#define LL_RCC_EPODBOOSTCLKSRCE_HSI16           RCC_CFGR4_BOOSTSEL_1
#define LL_RCC_EPODBOOSTCLKSRCE_HSE             ( RCC_CFGR4_BOOSTSEL_1 | RCC_CFGR4_BOOSTSEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_EPODBOOST_CLKPRESCAL  EPOD clock prescaler
  * @{
  */
#define LL_RCC_EPODBOOSTCLKPRESCAL_1            0U
#define LL_RCC_EPODBOOSTCLKPRESCAL_2            RCC_CFGR4_BOOSTDIV_0
#define LL_RCC_EPODBOOSTCLKPRESCAL_4            RCC_CFGR4_BOOSTDIV_1
#define LL_RCC_EPODBOOSTCLKPRESCAL_6            (RCC_CFGR4_BOOSTDIV_1 | RCC_CFGR4_BOOSTDIV_0)
#define LL_RCC_EPODBOOSTCLKPRESCAL_8            RCC_CFGR4_BOOSTDIV_2
#define LL_RCC_EPODBOOSTCLKPRESCAL_10           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_0)
#define LL_RCC_EPODBOOSTCLKPRESCAL_12           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_1)
#define LL_RCC_EPODBOOSTCLKPRESCAL_14           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_1 | RCC_CFGR4_BOOSTDIV_0)
#define LL_RCC_EPODBOOSTCLKPRESCAL_16           (RCC_CFGR4_BOOSTDIV_3)
/**
  * @}
  */


/** @defgroup RCC_LL_EF_Security_Services Security Services
  * @note Only available when system implements security (TZEN=1)
  * @{
  */
#define LL_RCC_ALL_NSEC                 0U                        /*!< No security on RCC resources (default) */
#define LL_RCC_ALL_SEC                  (RCC_SECCFGR_HSISEC    |\
                                         RCC_SECCFGR_HSESEC    |\
                                         RCC_SECCFGR_MSISEC    |\
                                         RCC_SECCFGR_LSISEC    |\
                                         RCC_SECCFGR_LSESEC    |\
                                         RCC_SECCFGR_SYSCLKSEC |\
                                         RCC_SECCFGR_PRESCSEC  |\
                                         RCC_SECCFGR_BOOSTSEC  |\
                                         RCC_SECCFGR_ICLKSEC   |\
                                         RCC_SECCFGR_HSI48SEC  |\
                                         RCC_SECCFGR_RMVFSEC)     /*!< Security on all RCC resources          */


#define LL_RCC_HSI_SEC                  RCC_SECCFGR_HSISEC      /*!< HSI clock configuration secure-only access */
#define LL_RCC_HSI_NSEC                 0U                      /*!< HSI clock configuration secure/non-secure access */
#define LL_RCC_HSE_SEC                  RCC_SECCFGR_HSESEC      /*!< HSE clock configuration secure-only access */
#define LL_RCC_HSE_NSEC                 0U                      /*!< HSE clock configuration secure/non-secure access */
#define LL_RCC_MSI_SEC                  RCC_SECCFGR_MSISEC      /*!< MSI clock configuration secure-only access */
#define LL_RCC_MSI_NSEC                 0U                      /*!< MSI clock configuration secure/non-secure access */
#define LL_RCC_LSI_SEC                  RCC_SECCFGR_LSISEC      /*!< LSI clock configuration secure-only access */
#define LL_RCC_LSI_NSEC                 0U                      /*!< LSI clock configuration secure/non-secure access */
#define LL_RCC_LSE_SEC                  RCC_SECCFGR_LSESEC      /*!< LSE clock configuration secure-only access */
#define LL_RCC_LSE_NSEC                 0U                      /*!< LSE clock configuration secure/non-secure access */
#define LL_RCC_SYSCLK_SEC               RCC_SECCFGR_SYSCLKSEC   /*!< SYSCLK clock; STOPWUCK and MCO output configuration secure-only access */
#define LL_RCC_SYSCLK_NSEC              0U                      /*!< SYSCLK clock; STOPWUCK and MCO output configuration secure/non-secure access */
#define LL_RCC_PRESCALERS_SEC           RCC_SECCFGR_PRESCSEC    /*!< AHBx/APBx prescaler configuration secure-only access */
#define LL_RCC_PRESCALERS_NSEC          0U                      /*!< AHBx/APBx prescaler configuration secure/non-secure access */
#define LL_RCC_BOOST_SEC                RCC_SECCFGR_BOOSTSEC    /*!< BOOST clock configuration secure-only access */
#define LL_RCC_BOOST_NSEC               0U                      /*!< BOOST clock configuration secure/non-secure access */
#define LL_RCC_ICLK_SEC                 RCC_SECCFGR_ICLKSEC     /*!< ICLK clock configuration secure-only access */
#define LL_RCC_ICLK_NSEC                0U                      /*!< ICLK clock configuration secure/non-secure access */
#define LL_RCC_HSI48_SEC                RCC_SECCFGR_HSI48SEC    /*!< HSI48 clock configuration secure-only access */
#define LL_RCC_HSI48_NSEC               0U                      /*!< HSI48 clock configuration secure/non-secure access */
#define LL_RCC_RESET_FLAGS_SEC          RCC_SECCFGR_RMVFSEC     /*!< Remove reset flag secure-only access */
#define LL_RCC_RESET_FLAGS_NSEC         0U                      /*!< Remove reset flag secure/non-secure access */
/**
  * @}
  */


#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO         0U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA         0xFFFFFFFFU        /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */


/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */


/** @defgroup RCC_LL_EM_CALC_FREQ Calculate frequencies
  * @{
  */


/**
  * @brief  Helper macro to calculate the HCLK frequency
  * @param  __SYSCLKFREQ__ SYSCLK frequency (based on HSE/MSIS/HSI16)
  * @param  __AHBPRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_512
  * @retval HCLK clock frequency (in Hz)
  */
#define __LL_RCC_CALC_HCLK_FREQ(__SYSCLKFREQ__, __AHBPRESCALER__) \
  ((__SYSCLKFREQ__) >> (AHBPrescTable[((__AHBPRESCALER__) & RCC_CFGR2_HPRE) >> RCC_CFGR2_HPRE_Pos]))

/**
  * @brief  Helper macro to calculate the PCLK1 frequency (ABP1)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB1PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PCLK1_FREQ(__HCLKFREQ__, __APB1PRESCALER__) \
  ((__HCLKFREQ__) >> (APBPrescTable[((__APB1PRESCALER__) & RCC_CFGR2_PPRE1) >> RCC_CFGR2_PPRE1_Pos]))

/**
  * @brief  Helper macro to calculate the PCLK2 frequency (ABP2)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB2PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_16
  * @retval PCLK2 clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PCLK2_FREQ(__HCLKFREQ__, __APB2PRESCALER__) \
  ((__HCLKFREQ__) >> (APBPrescTable[((__APB2PRESCALER__) & RCC_CFGR2_PPRE2) >> RCC_CFGR2_PPRE2_Pos]))


/**
  * @brief  Helper macro to calculate the PCLK3 frequency (ABP3)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB3PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_16
  * @retval PCLK3 clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PCLK3_FREQ(__HCLKFREQ__, __APB3PRESCALER__) \
  ((__HCLKFREQ__) >> (APBPrescTable[((__APB3PRESCALER__) & RCC_CFGR3_PPRE3) >> RCC_CFGR3_PPRE3_Pos]))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */


