stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/** @defgroup RCC_LL_EF_HSE HSE
  * @{
  */

/**
  * @brief  Enable HSE crystal oscillator (HSE ON)
  * @rmtoll CR           HSEON         LL_RCC_HSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSEON);
}

/**
  * @brief  Disable HSE crystal oscillator (HSE ON)
  * @rmtoll CR           HSEON         LL_RCC_HSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSEON);
}

/**
  * @brief  Check if HSE is enabled
  * @rmtoll CR           HSEON        LL_RCC_HSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSEON) == RCC_CR_HSEON) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE oscillator Ready
  * @rmtoll CR           HSERDY        LL_RCC_HSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSERDY) == RCC_CR_HSERDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Clock Security System.
  * @rmtoll CR           HSECSSON         LL_RCC_HSE_EnableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_EnableCSS(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSECSSON);
}

/**
  * @brief  Check if HSE CSS is enabled
  * @rmtoll CR           HSECSSON        LL_RCC_HSE_IsEnabledCSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsEnabledCSS(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSECSSON) == RCC_CR_HSECSSON) ? 1UL : 0UL);
}

/**
  * @brief  Enable bypass of the oscillator with an external clock.
  * @rmtoll CR           HSEBYP         LL_RCC_HSE_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_EnableBypass(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSEBYP);
}

/**
  * @brief  Disable bypass the oscillator with an external clock.
  * @rmtoll CR           HSEBYP         LL_RCC_HSE_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_DisableBypass(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSEBYP);
}

/**
  * @brief  Check if HSE bypass is enabled
  * @rmtoll CR           HSEBYP        LL_RCC_HSE_IsEnabledBypass
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsEnabledBypass(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSEBYP) == RCC_CR_HSEBYP) ? 1UL : 0UL);
}

/**
  * @brief  Set external clock mode in bypass mode.
  * @rmtoll CR           HSEEXT         LL_RCC_HSE_SetClockMode
  * @param  ClockMode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSE_ANALOG_MODE
  *         @arg @ref LL_RCC_HSE_DIGITAL_MODE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_SetClockMode(uint32_t ClockMode)
{
  MODIFY_REG(RCC->CR, RCC_CR_HSEEXT, ClockMode);
}

/**
  * @brief  Get external clock mode in bypass mode.
  * @rmtoll CR           HSEEXT         LL_RCC_HSE_GetClockMode
  * @retval  Return can be one of the following values:
  *         @arg @ref LL_RCC_HSE_ANALOG_MODE
  *         @arg @ref LL_RCC_HSE_DIGITAL_MODE
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetClockMode(void)
{
  return (READ_BIT(RCC->CR, RCC_CR_HSEEXT));
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_HSI HSI
  * @{
  */

/**
  * @brief  Enable HSI even in stop mode
  * @note HSI oscillator is forced ON even in Stop mode
  * @rmtoll CR           HSIKERON      LL_RCC_HSI_EnableInStopMode
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_EnableInStopMode(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSIKERON);
}

/**
  * @brief  Disable HSI in stop mode
  * @rmtoll CR           HSIKERON      LL_RCC_HSI_DisableInStopMode
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_DisableInStopMode(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSIKERON);
}

/**
  * @brief  Check if HSI is enabled in stop mode
  * @rmtoll CR           HSIKERON        LL_RCC_HSI_IsEnabledInStopMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsEnabledInStopMode(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSIKERON) == RCC_CR_HSIKERON) ? 1UL : 0UL);
}

/**
  * @brief  Enable HSI oscillator
  * @rmtoll CR           HSION         LL_RCC_HSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSION);
}

/**
  * @brief  Disable HSI oscillator
  * @rmtoll CR           HSION         LL_RCC_HSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSION);
}

/**
  * @brief  Check if HSI is enabled
  * @rmtoll CR           HSION        LL_RCC_HSI_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSION) == RCC_CR_HSION) ? 1UL : 0UL);
}


/**
  * @brief  Check if HSI clock is ready
  * @rmtoll CR           HSIRDY        LL_RCC_HSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSIRDY) == RCC_CR_HSIRDY) ? 1UL : 0UL);
}

/**
  * @brief  Get HSI Calibration value
  * @note When HSITRIM is written, HSICAL is updated with the sum of
  *       HSITRIM and the factory trim value
  * @rmtoll ICSCR3       HSICAL        LL_RCC_HSI_GetCalibration
  * @retval Between Min_Data = 0 and Max_Data = 4095
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR3, RCC_ICSCR3_HSICAL) >> RCC_ICSCR3_HSICAL_Pos);
}

/**
  * @brief  Set HSI Calibration trimming
  * @note user-programmable trimming value that is added to the HSICAL
  * @note Default value is 16, which, when added to the HSICAL value,
  *       should trim the HSI to 16 MHz +/- 1 %
  * @rmtoll ICSCR3        HSITRIM       LL_RCC_HSI_SetCalibTrimming
  * @param  Value Between Min_Data = 0 and Max_Data = 31
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_SetCalibTrimming(uint32_t Value)
{
  MODIFY_REG(RCC->ICSCR3, RCC_ICSCR3_HSITRIM, (Value << RCC_ICSCR3_HSITRIM_Pos));
}

/**
  * @brief  Get HSI Calibration trimming
  * @rmtoll ICSCR3        HSITRIM       LL_RCC_HSI_GetCalibTrimming
  * @retval Between Min_Data = 0 and Max_Data = 31
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_GetCalibTrimming(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR3, RCC_ICSCR3_HSITRIM) >> RCC_ICSCR3_HSITRIM_Pos);
}

/**
  * @brief  Enable HSI48 oscillator
  * @rmtoll CR           HSI48ON         LL_RCC_HSI48_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI48_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSI48ON);
}

/**
  * @brief  Disable HSI48 oscillator
  * @rmtoll CR           HSI48ON         LL_RCC_HSI48_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI48_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSI48ON);
}

/**
  * @brief  Check if HSI48 is enabled
  * @rmtoll CR           HSI48ON        LL_RCC_HSI48_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI48_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSI48ON) == RCC_CR_HSI48ON) ? 1UL : 0UL);
}


/**
  * @brief  Check if HSI48 clock is ready
  * @rmtoll CR           HSI48RDY        LL_RCC_HSI48_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI48_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSI48RDY) == RCC_CR_HSI48RDY) ? 1UL : 0UL);
}

/**
  * @brief  Get HSI48 Calibration value
  * @note  Read value initialized at startup with the factory-programmed HSI48 calibration trim value
  * @rmtoll CRRCR       HSI48CAL        LL_RCC_HSI48_GetCalibration
  * @retval Between Min_Data = 0 and Max_Data = 512
  */
__STATIC_INLINE uint32_t LL_RCC_HSI48_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->CRRCR, RCC_CRRCR_HSI48CAL) >> RCC_CRRCR_HSI48CAL_Pos);
}


/**
  * @}
  */


/** @defgroup RCC_LL_EF_MSI MSI
  * @{
  */

/**
  * @brief  Set MSI clock range with (MSISDIV[1:0] and MSIKDIV[1:0])
  * @note Set the MSIS and MSIK clocks range with (MSISDIV[1:0] and MSIKDIV[1:0])
  *       instead of (MSISDIVS[1:0] and MSIKDIVS[1:0])
  * @rmtoll ICSCR1        MSIRGSEL        LL_RCC_MSI_SetMSIxClockRange
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_SetMSIxClockRange(void)
{
  SET_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL);
}

/**
  * @brief  Get MSI clock range
  * @rmtoll ICSCR1        MSIRGSEL        LL_RCC_MSI_GetMSIxClockRange
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSI_CLOCK_RANGE_MSIXDIVS
  *         @arg @ref LL_RCC_MSI_CLOCK_RANGE_MSIXDIV
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_GetMSIxClockRange(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIRGSEL));
}

/**
  * @brief  Set MSI bias mode
  * @note Set MSI bias mode - continuous mode maintains the output clocks accuracy but lead to higher consumption
  * @rmtoll ICSCR1        MSIBIAS        LL_RCC_MSI_SetBiasMode
  * @param  MSIBiasMode This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSI_BIAS_MODE_CONTINUOUS
  *         @arg @ref LL_RCC_MSI_BIAS_MODE_SAMPLING
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_SetBiasMode(uint32_t MSIBiasMode)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIBIAS, MSIBiasMode);
}

/**
  * @brief  Get MSI bias mode
  * @rmtoll ICSCR1        MSIBIAS        LL_RCC_MSI_GetBiasMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSI_BIAS_MODE_CONTINUOUS
  *         @arg @ref LL_RCC_MSI_BIAS_MODE_SAMPLING
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_GetBiasMode(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIBIAS));
}

/**
  * @brief  Enable MSIS oscillator
  * @rmtoll CR           MSISON         LL_RCC_MSIS_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIS_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSISON);
}

/**
  * @brief  Disable MSIS oscillator
  * @rmtoll CR           MSISON         LL_RCC_MSIS_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIS_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSISON);
}

/**
  * @brief  Check if MSIS is enabled or not
  * @rmtoll CR    MSISON        LL_RCC_MSIS_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_MSIS_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSISON) == RCC_CR_MSISON) ? 1UL : 0UL);
}

/**
  * @brief  Check if MSIS clock is ready
  * @rmtoll CR           MSISRDY        LL_RCC_MSIS_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_MSIS_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSISRDY) == RCC_CR_MSISRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set MSIS clock source
  * @note  Select the RC oscillator used to generate MSIS clock
  * @rmtoll ICSCR1        MSISSEL        LL_RCC_MSIS_SetClockSource
  * @param  MSISClockSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC0 (96MHz)
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC1 (24MHz)
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIS_SetClockSource(uint32_t MSISClockSource)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSISSEL, MSISClockSource);
}

/**
  * @brief  Get MSIS clock source
  * @rmtoll ICSCR1        MSISSEL        LL_RCC_MSIS_GetClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC0 (96MHz)
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC1 (24MHz)
  */
__STATIC_INLINE uint32_t LL_RCC_MSIS_GetClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSISSEL));
}

/**
  * @brief  Set MSIS clock division
  * @note  Select the MSIS division factor
  *        if MSIS clock source is LL_RCC_MSIS_CLOCK_SOURCE_RC0
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1: MSIRC0 /1 is selected for MSIS (range 0 around 96 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2: MSIRC0 /2 is selected for MSIS (range 1 around 48 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4: MSIRC0 /4 is selected for MSIS (range 2 around 24 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8: MSIRC0 /8 is selected for MSIS (range 3 around 12 MHz)
  *        if MSIS clock source is LL_RCC_MSIS_CLOCK_SOURCE_RC1
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1: MSIRC1 /1 is selected for MSIS (range 4 around 24 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2: MSIRC1 /2 is selected for MSIS (range 5 around 12 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4: MSIRC1 /4 is selected for MSIS (range 6 around 6 MHz)
  *          LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8: MSIRC1 /8 is selected for MSIS (range 7 around 3 MHz)
  * @rmtoll ICSCR1        MSISDIV        LL_RCC_MSIS_SetClockDivision
  * @param  MSISClockDivision This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIS_SetClockDivision(uint32_t MSISClockDivision)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSISDIV, MSISClockDivision);
}

/**
  * @brief  Get MSIS clock division
  * @rmtoll ICSCR1        MSISDIV        LL_RCC_MSIS_GetClockDivision
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4
  *         @arg @ref LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8
  */
__STATIC_INLINE uint32_t LL_RCC_MSIS_GetClockDivision(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSISDIV));
}

/**
  * @brief  Set MSIS oscillator division after Standby mode
  * @note Set MSIS frequency at Standby mode exit and until MSIRGSEL is set
  * @rmtoll CSR        MSISDIVS        LL_RCC_MSIS_SetFreqAfterStandby
  * @param  MSISdivs This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_5
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_6
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIS_SetFreqAfterStandby(uint32_t MSISdivs)
{
  MODIFY_REG(RCC->CSR, RCC_CSR_MSISDIVS, MSISdivs);
}

/**
  * @brief  Get MSIS oscillator division after Standby mode
  * @rmtoll CSR        MSISDIVS        LL_RCC_MSIS_GetFreqAfterStandby
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_5
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_6
  *         @arg @ref LL_RCC_MSISDIVS_RANGE_7
  */
__STATIC_INLINE uint32_t LL_RCC_MSIS_GetFreqAfterStandby(void)
{
  return (uint32_t)(READ_BIT(RCC->CSR, RCC_CSR_MSISDIVS));
}

/**
  * @brief  Enable MSI for some peripheral kernels
  * @rmtoll CR           MSIKERON         LL_RCC_MSIKER_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIKER_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIKERON);
}

/**
  * @brief  Disable MSI for some peripheral kernels
  * @rmtoll CR           MSIKERON         LL_RCC_MSIKER_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIKER_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIKERON);
}

/**
  * @brief  Check if MSIKER is enabled or not
  * @rmtoll CR    MSIKERON        LL_RCC_MSIKER_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_MSIKER_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIKERON) == RCC_CR_MSIKERON) ? 1UL : 0UL);
}

/**
  * @brief  Enable MSIK oscillator
  * @rmtoll CR           MSIKON         LL_RCC_MSIK_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIK_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIKON);
}

/**
  * @brief  Disable MSIK oscillator
  * @rmtoll CR           MSIKON         LL_RCC_MSIK_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIK_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIKON);
}

/**
  * @brief  Check if MSIK is enabled or not
  * @rmtoll CR    MSIKON        LL_RCC_MSIK_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_MSIK_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIKON) == RCC_CR_MSIKON) ? 1UL : 0UL);
}

/**
  * @brief  Check if MSIK clock is ready
  * @rmtoll CR           MSIKRDY        LL_RCC_MSIK_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_MSIK_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIKRDY) == RCC_CR_MSIKRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set MSIK clock source
  * @note  Select the RC oscillator used to generate MSIK clock
  * @rmtoll ICSCR1        MSIKSEL        LL_RCC_MSIK_SetClockSource
  * @param  MSIKClockSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC0 (96MHz)
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC1 (24MHz)
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIK_SetClockSource(uint32_t MSIKClockSource)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIKSEL, MSIKClockSource);
}

/**
  * @brief  Get MSIK clock source
  * @rmtoll ICSCR1        MSIKSEL        LL_RCC_MSIK_GetClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC0 (96MHz)
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC1 (24MHz)
  */
__STATIC_INLINE uint32_t LL_RCC_MSIK_GetClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIKSEL));
}

/**
  * @brief  Set MSIK clock division
  * @note  Select the MSIK division factor
  *        if MSIK clock source is LL_RCC_MSIK_CLOCK_SOURCE_RC0
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1: MSIRC0 /1 is selected for MSIK (range 0 around 96 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2: MSIRC0 /2 is selected for MSIK (range 1 around 48 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4: MSIRC0 /4 is selected for MSIK (range 2 around 24 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8: MSIRC0 /8 is selected for MSIK (range 3 around 12 MHz)
  *        if MSIK clock source is LL_RCC_MSIK_CLOCK_SOURCE_RC1
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1: MSIRC1 /1 is selected for MSIK (range 4 around 24 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2: MSIRC1 /2 is selected for MSIK (range 5 around 12 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4: MSIRC1 /4 is selected for MSIK (range 6 around 6 MHz)
  *          LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8: MSIRC1 /8 is selected for MSIK (range 7 around 3 MHz)
  * @rmtoll ICSCR1        MSIKDIV        LL_RCC_MSIK_SetClockDivision
  * @param  MSIKClockDivision This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIK_SetClockDivision(uint32_t MSIKClockDivision)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIKDIV, MSIKClockDivision);
}

/**
  * @brief  Get MSIK clock division
  * @rmtoll ICSCR1        MSIKDIV        LL_RCC_MSIK_GetClockDivision
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4
  *         @arg @ref LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8
  */
__STATIC_INLINE uint32_t LL_RCC_MSIK_GetClockDivision(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIKDIV));
}

/**
  * @brief  Set MSIK oscillator division after Standby mode
  * @note Set MSIK frequency at Standby mode exit and until MSIRGSEL is set
  * @rmtoll CSR        MSIKDIVS        LL_RCC_MSIK_SetFreqAfterStandby
  * @param  MSIKdivs This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_5
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_6
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSIK_SetFreqAfterStandby(uint32_t MSIKdivs)
{
  MODIFY_REG(RCC->CSR, RCC_CSR_MSIKDIVS, MSIKdivs);
}

/**
  * @brief  Get MSIK oscillator division after Standby mode
  * @rmtoll CSR        MSIKDIVS        LL_RCC_MSIK_GetFreqAfterStandby
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_5
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_6
  *         @arg @ref LL_RCC_MSIKDIVS_RANGE_7
  */
__STATIC_INLINE uint32_t LL_RCC_MSIK_GetFreqAfterStandby(void)
{
  return (uint32_t)(READ_BIT(RCC->CSR, RCC_CSR_MSIKDIVS));
}

/**
  * @brief  Set MSIRCx PLL-mode HSE input division
  * @note Divide HSE input clock when used by MSI in PLL-mode. MSI high speed input clock must be  16 Mhz.
  * @rmtoll ICSCR1        MSIHSINDIV        LL_RCC_MSI_RCx_SetPLLmodeHSEInputDiv
  * @param  HSEInputDiv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIRCx_PLLMODE_INPUT_HSE
  *         @arg @ref LL_RCC_MSIRCx_PLLMODE_INPUT_HSE_DIV_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RCx_SetPLLmodeHSEInputDiv(uint32_t HSEInputDiv)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIHSINDIV, HSEInputDiv);
}

/**
  * @brief  Get MSIRCx PLL-mode HSE input division
  * @rmtoll ICSCR1        MSIHSINDIV        LL_RCC_MSI_RCx_GetPLLmodeHSEInputDiv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIRCx_PLLMODE_INPUT_HSE
  *         @arg @ref LL_RCC_MSIRCx_PLLMODE_INPUT_HSE_DIV_2
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RCx_GetPLLmodeHSEInputDiv(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIHSINDIV));
}


/**
  * @brief  Enable MSI RC0  PLL-mode
  * @rmtoll CR           MSIPLL0EN         LL_RCC_MSI_RC0_PLLmode_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_PLLmode_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIPLL0EN);
}

/**
  * @brief  Disable MSI RC0  PLL-mode
  * @rmtoll CR           MSIPLL0EN         LL_RCC_MSI_RC0_PLLmode_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_PLLmode_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIPLL0EN);
}

/**
  * @brief  Check if MSI RC0  PLL-mode is enabled or not
  * @rmtoll CR    MSIPLL1EN        LL_RCC_MSI_RC0_PLLmode_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_PLLmode_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIPLL0EN) == RCC_CR_MSIPLL0EN) ? 1UL : 0UL);
}

/**
  * @brief  Check if MSI RC0 PLL mode is ready
  * @rmtoll CR           MSIPLL0RDY        LL_RCC_MSI_RC0_PLLmode_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_PLLmode_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIPLL0RDY) == RCC_CR_MSIPLL0RDY) ? 1UL : 0UL);
}

/**
  * @brief  Set MSIRC0 PLL-mode input clock
  * @note LSE or HSE must be enabled and ready before selecting this oscillator as MSIRC0 input clock
  * @rmtoll ICSCR1        MSIPLL0SEL        LL_RCC_MSI_RC0_SetPLLInputClk
  * @param  MSIPLL0sel This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL0SEL_LSE
  *         @arg @ref LL_RCC_MSIPLL0SEL_HSE_OR_HSEDIV2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_SetPLLInputClk(uint32_t MSIPLL0sel)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIPLL0SEL, MSIPLL0sel);
}

/**
  * @brief  Get MSIRC0 PLL-mode input clock
  * @rmtoll ICSCR1        MSIPLL0SEL        LL_RCC_MSI_RC0_GetPLLInputClk
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL0SEL_LSE
  *         @arg @ref LL_RCC_MSIPLL0SEL_HSE_OR_HSEDIV2
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_GetPLLInputClk(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIPLL0SEL));
}

/**
  * @brief  MSI RC0 PLL mode fast startup
  * @rmtoll CR           MSIPLL0FAST         LL_RCC_MSI_RC0_PLLmode_FastStartup
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_PLLmode_FastStartup(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIPLL0FAST);
}

