stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/**
  * @brief  MSI RC0 PLL mode normal startup
  * @rmtoll CR           MSIPLL0FAST         LL_RCC_MSI_RC0_PLLmode_NormalStartup
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_PLLmode_NormalStartup(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIPLL0FAST);
}

/**
  * @brief  Get MSIRC0 PLL-mode startup status
  * @rmtoll CR        MSIPLL0FAST        LL_RCC_MSI_RC0_PLLmode_GetStartupStatus
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL0_STARTUP_NORMAL
  *         @arg @ref LL_RCC_MSIPLL0_STARTUP_FAST
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_PLLmode_GetStartupStatus(void)
{
  return (uint32_t)(READ_BIT(RCC->CR, RCC_CR_MSIPLL0FAST));
}


/**
  * @brief  Set MSI clock trimming for ranges 0 to 3
  * @note Additional user-programmable trimming value that is added to the factory-programmed
  *       calibration trim value MSIRC0[5:0] bits.
  * @rmtoll ICSCR2        MSITRIM0        LL_RCC_MSI_RC0_SetTrimming
  * @param  TrimValue
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC0_SetTrimming(uint32_t TrimValue)
{
  MODIFY_REG(RCC->ICSCR2, RCC_ICSCR2_MSITRIM0, (TrimValue << RCC_ICSCR2_MSITRIM0_Pos));
}

/**
  * @brief  Get MSI clock trimming for ranges 0 to 3
  * @note Additional user-programmable trimming value that is added to the factory-programmed
  *       calibration trim value MSIRC0[5:0] bits.
  * @rmtoll ICSCR2        MSITRIM0        LL_RCC_MSI_RC0_GetTrimming
  * @retval TrimValue
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_GetTrimming(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR2, RCC_ICSCR2_MSITRIM0) >> RCC_ICSCR2_MSITRIM0_Pos);
}

/**
  * @brief  Get MSIRC0 clock calibration for MSI ranges 0 to 3
  * @note Field initialized at startup with the factory-programmed MSIRC0 calibration trim value for ranges 0 to 3.
  *       When MSITRIM0 is written, MSICAL0 is updated with the sum of MSITRIM0[5:0] and the
  *       factory-programmed calibration trim value MSIRC0[5:0].
  * @rmtoll ICSCR1        MSICAL0        LL_RCC_MSI_RC0_GetCalibration
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC0_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSICAL0) >> RCC_ICSCR1_MSICAL0_Pos);
}

/**
  * @brief  Enable MSI RC1  PLL-mode
  * @rmtoll CR           MSIPLL1EN         LL_RCC_MSI_RC1_PLLmode_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_PLLmode_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIPLL1EN);
}

/**
  * @brief  Disable MSI RC1  PLL-mode
  * @rmtoll CR           MSIPLL1EN         LL_RCC_MSI_RC1_PLLmode_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_PLLmode_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIPLL1EN);
}

/**
  * @brief  Check if MSI RC1  PLL-mode is enabled or not
  * @rmtoll CR    MSIPLL1EN        LL_RCC_MSI_RC1_PLLmode_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_PLLmode_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIPLL1EN) == RCC_CR_MSIPLL1EN) ? 1UL : 0UL);
}

/**
  * @brief  Check if MSI RC1 PLL mode is ready
  * @rmtoll CR           MSIPLL1RDY        LL_RCC_MSI_RC1_PLLmode_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_PLLmode_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_MSIPLL1RDY) == RCC_CR_MSIPLL1RDY) ? 1UL : 0UL);
}

/**
  * @brief  Set MSIRC1 PLL-mode input clock
  * @note LSE or HSE must be enabled and ready before selecting this oscillator as MSIRC1 input clock
  * @rmtoll ICSCR1        MSIPLL1SEL        LL_RCC_MSI_RC1_SetPLLInputClk
  * @param  MSIPLL1sel This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL1SEL_LSE
  *         @arg @ref LL_RCC_MSIPLL1SEL_HSE_OR_HSEDIV2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_SetPLLInputClk(uint32_t MSIPLL1sel)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIPLL1SEL, MSIPLL1sel);
}

/**
  * @brief  Get MSIRC1 PLL-mode input clock
  * @rmtoll ICSCR1        MSIPLL1SEL        LL_RCC_MSI_RC1_GetPLLInputClk
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL1SEL_LSE
  *         @arg @ref LL_RCC_MSIPLL1SEL_HSE_OR_HSEDIV2
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_GetPLLInputClk(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIPLL1SEL));
}

/**
  * @brief  Set MSIRC1 PLL-mode LSE multiplication factor
  *         MSIRC1 frequency is MSIPLL1N * fLSE.
  * @note LSE or HSE must be enabled and ready before selecting this oscillator as MSIRC1 input clock
  *       MSIS and MSIK ranges 4, 5 6 and 7 frequencies are therefore impacted accordingly
  * @rmtoll ICSCR1        MSIPLL1N[1:0]        LL_RCC_MSI_RC1_SetLSEMultiplicationFactor
  * @param  LSEMultiplicationFactor This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_732 (Freq MSIRC1 = 23.9862 MHz)
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_689 (Freq MSIRC1 = 22.5772 MHz)
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_750 (Freq MSIRC1 = 24.576 MHz)
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_SetLSEMultiplicationFactor(uint32_t LSEMultiplicationFactor)
{
  MODIFY_REG(RCC->ICSCR1, RCC_ICSCR1_MSIPLL1N, LSEMultiplicationFactor);
}

/**
  * @brief  Get MSIRC1 PLL-mode LSE multiplication factor
  * @rmtoll ICSCR1        MSIPLL1N[1:0]        LL_RCC_MSI_RC1_GetLSEMultiplicationFactor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_732
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_689
  *         @arg @ref LL_RCC_MSIRC1_PLLMODE_LSE_MULT_750
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_GetLSEMultiplicationFactor(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSIPLL1N));
}

/**
  * @brief  MSI RC1 PLL mode fast startup
  * @rmtoll CR           MSIPLL1FAST         LL_RCC_MSI_RC1_PLLmode_FastStartup
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_PLLmode_FastStartup(void)
{
  SET_BIT(RCC->CR, RCC_CR_MSIPLL1FAST);
}

/**
  * @brief  MSI RC1 PLL mode normal startup
  * @rmtoll CR           MSIPLL1FAST         LL_RCC_MSI_RC1_PLLmode_NormalStartup
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_PLLmode_NormalStartup(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_MSIPLL1FAST);
}

/**
  * @brief  Get MSIRC1 PLL-mode startup status
  * @rmtoll CR        MSIPLL1FAST        LL_RCC_MSI_RC1_PLLmode_GetStartupStatus
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MSIPLL1_STARTUP_NORMAL
  *         @arg @ref LL_RCC_MSIPLL1_STARTUP_FAST
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_PLLmode_GetStartupStatus(void)
{
  return (uint32_t)(READ_BIT(RCC->CR, RCC_CR_MSIPLL1FAST));
}


/**
  * @brief  Set MSI clock trimming for ranges 4 to 7
  * @note Additional user-programmable trimming value that is added to the factory-programmed
  *       calibration trim value MSIRC1[5:0] bits.
  * @rmtoll ICSCR2        MSITRIM1        LL_RCC_MSI_RC1_SetTrimming
  * @param  TrimValue
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_RC1_SetTrimming(uint32_t TrimValue)
{
  MODIFY_REG(RCC->ICSCR2, RCC_ICSCR2_MSITRIM1, (TrimValue << RCC_ICSCR2_MSITRIM1_Pos));
}

/**
  * @brief  Get MSI clock trimming for ranges 4 to 7
  * @note Additional user-programmable trimming value that is added to the factory-programmed
  *       calibration trim value MSIRC1[5:0] bits.
  * @rmtoll ICSCR2        MSITRIM1        LL_RCC_MSI_RC1_GetTrimming
  * @retval TrimValue
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_GetTrimming(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR2, RCC_ICSCR2_MSITRIM1) >> RCC_ICSCR2_MSITRIM1_Pos);
}

/**
  * @brief  Get MSIRC1 clock calibration for MSI ranges 0 to 3
  * @note Field initialized at startup with the factory-programmed MSIRC1 calibration trim value for ranges 4 to 7.
  *       When MSITRIM1 is written, MSICAL1 is updated with the sum of MSITRIM1[5:0] and the
  *       factory-programmed calibration trim value MSIRC1[5:0].
  * @rmtoll ICSCR1        MSICAL1        LL_RCC_MSI_RC1_GetCalibration
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_RC1_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->ICSCR1, RCC_ICSCR1_MSICAL1) >> RCC_ICSCR1_MSICAL1_Pos);
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_LSE LSE
  * @{
  */

/**
  * @brief  Enable Low Speed External (LSE) crystal.
  * @rmtoll BDCR        LSEON         LL_RCC_LSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Enable(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);
}

/**
  * @brief  Disable Low Speed External (LSE) crystal.
  * @rmtoll BDCR        LSEON         LL_RCC_LSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Disable(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);
}

/**
  * @brief  Check if LSE is enabled or not
  * @rmtoll BDCR    LSEON        LL_RCC_LSE_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabled(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSEON) == RCC_BDCR_LSEON) ? 1UL : 0UL);
}

/**
  * @brief  Enable external clock source (LSE bypass).
  * @rmtoll BDCR        LSEBYP        LL_RCC_LSE_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableBypass(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
}

/**
  * @brief  Disable external clock source (LSE bypass).
  * @rmtoll BDCR        LSEBYP        LL_RCC_LSE_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableBypass(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
}

/**
  * @brief  Check if LSE bypass is enabled or not
  * @rmtoll BDCR    LSEBYP        LL_RCC_LSE_IsEnabledBypass
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabledBypass(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSEBYP) == RCC_BDCR_LSEBYP) ? 1UL : 0UL);
}

/**
  * @brief  Enable LSE clock glitch filter.
  * @rmtoll BDCR        LSEGFON        LL_RCC_LSE_EnableGLITCH_FILTER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableGLITCH_FILTER(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEGFON);
}

/**
  * @brief  Disable LSE clock glitch filter.
  * @rmtoll BDCR        LSEGFON        LL_RCC_LSE_DisableGLITCH_FILTER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableGLITCH_FILTER(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEGFON);
}

/**
  * @brief  Check if LSE clock glitch filter is enabled or not
  * @rmtoll BDCR    LSEGFON        LL_RCC_LSE_IsEnabledGLITCH_FILTER
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabledGLITCH_FILTER(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSEGFON) == RCC_BDCR_LSEGFON) ? 1UL : 0UL);
}

/**
  * @brief  Set LSE oscillator drive capability
  * @note The oscillator is in Xtal mode when it is not in bypass mode.
  * @rmtoll BDCR        LSEDRV        LL_RCC_LSE_SetDriveCapability
  * @param  LSEDrive This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_SetDriveCapability(uint32_t LSEDrive)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSEDRV, LSEDrive);
}

/**
  * @brief  Get LSE oscillator drive capability
  * @rmtoll BDCR        LSEDRV        LL_RCC_LSE_GetDriveCapability
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_GetDriveCapability(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_LSEDRV));
}

/**
  * @brief  Enable Clock security system on LSE.
  * @rmtoll BDCR        LSECSSON      LL_RCC_LSE_EnableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableCSS(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Disable Clock security system on LSE.
  * @note Clock security system can be disabled only after a LSE
  *       failure detection. In that case it MUST be disabled by software.
  * @rmtoll BDCR        LSECSSON      LL_RCC_LSE_DisableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableCSS(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Check if LSE CSS is enabled or not
  * @rmtoll BDCR    LSECSSON        LL_RCC_LSE_IsEnabledCSS
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabledCSS(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSECSSON) == RCC_BDCR_LSECSSON) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE oscillator Ready
  * @rmtoll BDCR        LSERDY        LL_RCC_LSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsReady(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) == RCC_BDCR_LSERDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable LSE oscillator propagation for system clock
  * @rmtoll BDCR        LSESYSEN      LL_RCC_LSE_EnablePropagation
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnablePropagation(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSESYSEN);
}

/**
  * @brief  Disable LSE oscillator propagation for system clock
  * @rmtoll BDCR        LSESYSEN      LL_RCC_LSE_DisablePropagation
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisablePropagation(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSESYSEN);
}

/**
  * @brief  Check if LSE oscillator propagation is enabled or not
  * @rmtoll BDCR    LSESYSEN        LL_RCC_LSE_IsEnabledPropagation
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabledPropagation(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSESYSEN) == RCC_BDCR_LSESYSEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE oscillator propagation for system clock Ready
  * @rmtoll BDCR        LSESYSRDY     LL_RCC_LSE_IsPropagationReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsPropagationReady(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSESYSRDY) == RCC_BDCR_LSESYSRDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if CSS on LSE failure Detection
  * @rmtoll BDCR        LSECSSD       LL_RCC_LSE_IsCSSDetected
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsCSSDetected(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSECSSD) == RCC_BDCR_LSECSSD) ? 1UL : 0UL);
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable Low Speed Internal (LSI) oscillator.
  * @rmtoll CSR        LSION         LL_RCC_LSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Enable(void)
{
  SET_BIT(RCC->CSR, RCC_CSR_LSION);
}

/**
  * @brief  Disable Low Speed Internal (LSI) oscillator.
  * @rmtoll CSR        LSION         LL_RCC_LSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Disable(void)
{
  CLEAR_BIT(RCC->CSR, RCC_CSR_LSION);
}

/**
  * @brief  Check if LSI is enabled or not
  * @rmtoll CSR    LSION        LL_RCC_LSI_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsEnabled(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_LSION) == RCC_CSR_LSION) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI oscillator Ready
  * @rmtoll CSR        LSIRDY        LL_RCC_LSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsReady(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) == RCC_CSR_LSIRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set LSI divider configuration
  * @note Set low-speed clock divider configuration
  * @rmtoll CSR        LSIPREDIV        LL_RCC_LSI_SetClockPrediv
  * @param  LSIprediv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSI_PREDIV_NONE
  *         @arg @ref LL_RCC_LSI_PREDIV_128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_SetClockPrediv(uint32_t LSIprediv)
{
  MODIFY_REG(RCC->CSR, RCC_CSR_LSIPREDIV, LSIprediv);
}

/**
  * @brief  Get LSI divider configuration
  * @note Get low-speed clock divider configuration
  * @rmtoll CSR        LSIPREDIV        LL_RCC_LSI_GetClockPrediv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSI_PREDIV_NONE
  *         @arg @ref LL_RCC_LSI_PREDIV_128
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_GetClockPrediv(void)
{
  return (uint32_t)(READ_BIT(RCC->CSR, RCC_CSR_LSIPREDIV));
}

/**
  * @}
  */


