stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @rmtoll BDCR        RTCSEL        LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @rmtoll BDCR        RTCSEL        LL_RCC_GetRTCClockSource
  * @param  RTCx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(uint32_t RTCx_clksource)
{
  UNUSED(RTCx_clksource);
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL));
}

/**
  * @brief  Enable RTC and TAMP clock
  * @rmtoll BDCR           RTCEN         LL_RCC_RTC_ClockEnable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_ClockEnable(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Disable RTC and TAMP clock
  * @rmtoll BDCR           RTCEN         LL_RCC_RTC_ClockDisable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RTC_ClockDisable(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Check if RTC and TAMP clock is enabled or not
  * @rmtoll BDCR    RTCEN        LL_RCC_RTC_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_RTC_IsEnabled(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) == RCC_BDCR_RTCEN) ? 1UL : 0UL);
}


/**
  * @brief  Force the Backup domain reset
  * @rmtoll BDCR        BDRST         LL_RCC_ForceBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ForceBackupDomainReset(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @rmtoll BDCR        BDRST         LL_RCC_ReleaseBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_LSCO LSCO
  * @{
  */

/**
  * @brief  Enable Low speed clock
  * @rmtoll BDCR        LSCOEN        LL_RCC_LSCO_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCO_Enable(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSCOEN);
}

/**
  * @brief  Disable Low speed clock
  * @rmtoll BDCR        LSCOEN        LL_RCC_LSCO_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCO_Disable(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSCOEN);
}

/**
  * @brief  Check if LSCO is enabled or not
  * @rmtoll BDCR    LSCOEN        LL_RCC_LSCO_IsEnabled
  * @retval 1 or 0
  */
__STATIC_INLINE uint32_t LL_RCC_LSCO_IsEnabled(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSCOEN) == RCC_BDCR_LSCOEN) ? 1UL : 0UL);
}

/**
  * @brief  Configure Low speed clock selection
  * @rmtoll BDCR        LSCOSEL       LL_RCC_LSCO_SetSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCO_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSCOSEL, Source);
}

/**
  * @brief  Get Low speed clock selection
  * @rmtoll BDCR        LSCOSEL       LL_RCC_LSCO_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_LSCO_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_LSCOSEL));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_System System
  * @{
  */

/**
  * @brief  Configure the system clock source
  * @rmtoll CFGR1         SW           LL_RCC_SetSysClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_MSIS
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSysClkSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_SW, Source);
}

/**
  * @brief  Get the system clock source
  * @rmtoll CFGR1        SWS           LL_RCC_GetSysClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_MSIS
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSysClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_SWS));
}

/**
  * @brief  Select Wakeup from Stop and CSS backup clock
  * @note  Select the system clock used when exiting Stop mode
  * @rmtoll CFGR1        STOPWUCK        LL_RCC_SetStopWakeupClock
  * @param  Clock This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUP_CLK_MSIS
  *         @arg @ref LL_RCC_STOP_WAKEUP_CLK_HSI16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetStopWakeupClock(uint32_t Clock)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_STOPWUCK, Clock);
}

/**
  * @brief  Get Wakeup from Stop and CSS backup clock
  * @rmtoll CFGR1        STOPWUCK        LL_RCC_GetStopWakeupClock
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUP_CLK_MSIS
  *         @arg @ref LL_RCC_STOP_WAKEUP_CLK_HSI16
  */
__STATIC_INLINE uint32_t LL_RCC_GetStopWakeupClock(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_STOPWUCK));
}

/**
  * @brief  Select Wakeup from Stop kernel clock
  * @note  Select the kernel clock used when exiting Stop mode
  * @rmtoll CFGR1        STOPKERWUCK        LL_RCC_SetStopWakeupKernelClock
  * @param  Clock This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUP_KERCLK_MSIK
  *         @arg @ref LL_RCC_STOP_WAKEUP_KERCLK_HSI16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetStopWakeupKernelClock(uint32_t Clock)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_STOPKERWUCK, Clock);
}

/**
  * @brief  Get Wakeup from Stop kernel clock
  * @rmtoll CFGR1        STOPKERWUCK        LL_RCC_GetStopWakeupKernelClock
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_STOP_WAKEUP_KERCLK_MSIK
  *         @arg @ref LL_RCC_STOP_WAKEUP_KERCLK_HSI16
  */
__STATIC_INLINE uint32_t LL_RCC_GetStopWakeupKernelClock(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_STOPKERWUCK));
}

/**
  * @brief  Set AHB prescaler
  * @rmtoll CFGR2        HPRE          LL_RCC_SetAHBPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_512
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAHBPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_HPRE, Prescaler);
}

/**
  * @brief  Get AHB prescaler
  * @rmtoll CFGR2         HPRE          LL_RCC_GetAHBPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_HCLK_SYSCLK_DIV_512
  */
__STATIC_INLINE uint32_t LL_RCC_GetAHBPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_HPRE));
}

/**
  * @brief  Set APB1 prescaler
  * @rmtoll CFGR2         PPRE1         LL_RCC_SetAPB1Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB1Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE1, Prescaler);
}

/**
  * @brief  Get APB1 prescaler
  * @rmtoll CFGR2         PPRE1         LL_RCC_GetAPB1Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB1_HCLK_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB1Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_PPRE1));
}

/**
  * @brief  Set APB2 prescaler
  * @rmtoll CFGR2         PPRE2         LL_RCC_SetAPB2Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB2Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE2, Prescaler);
}

/**
  * @brief  Get APB2 prescaler
  * @rmtoll CFGR2         PPRE2         LL_RCC_GetAPB2Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB2_HCLK_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB2Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_PPRE2));
}

/**
  * @brief  Set APB3 prescaler
  * @rmtoll CFGR3         PPRE3         LL_RCC_SetAPB3Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB3Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PPRE3, Prescaler);
}

/**
  * @brief  Get APB3 prescaler
  * @rmtoll CFGR3         PPRE3         LL_RCC_GetAPB3Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_1
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_2
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_4
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_8
  *         @arg @ref LL_RCC_APB3_HCLK_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB3Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_PPRE3));
}

/**
  * @brief  Set Systick clock source
  * @rmtoll CCIPR1      SYSTICKSEL    LL_RCC_SetSystickClockSource
  * @param  SystickSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSystickClockSource(uint32_t SystickSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[SystickSource >> 24];
  uint8_t  pos   = (uint8_t)(SystickSource >> 16) & 0x1FU;
  uint32_t mask  = (SystickSource >> 8) & 0x000000FFU;
  uint32_t value = (SystickSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get Sysctick clock source
  * @rmtoll CCIPR1       SYSTICKSEL    LL_RCC_GetSystickClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8
  */
__STATIC_INLINE uint32_t LL_RCC_GetSystickClockSource(void)
{
  const uint32_t Systick_clksource = LL_RCC_SYSTICK_CLKSOURCE;
  const __IO uint32_t *addr = ccipr_addr_reg[Systick_clksource >> 24];
  uint8_t  pos   = (uint8_t)(Systick_clksource >> 16) & 0x1FU;
  uint32_t mask  = (Systick_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*(const __IO uint32_t *)addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((Systick_clksource & 0xFFFFFF00U) | value);
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_MCO MCO
  * @{
  */

/**
  * @brief  Set MCO clock source
  * @rmtoll CFGR1         MCOSEL        LL_RCC_SetSourceClockMCO\n
  * @param  MCOSourceClock This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCOSOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCOSOURCE_MSIS
  *         @arg @ref LL_RCC_MCOSOURCE_HSI16
  *         @arg @ref LL_RCC_MCOSOURCE_HSE
  *         @arg @ref LL_RCC_MCOSOURCE_LSI
  *         @arg @ref LL_RCC_MCOSOURCE_LSE
  *         @arg @ref LL_RCC_MCOSOURCE_HSI48
  *         @arg @ref LL_RCC_MCOSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSourceClockMCO(uint32_t MCOSourceClock)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_MCOSEL, MCOSourceClock);
}

/**
  * @brief  Get MCO clock source
  * @rmtoll CFGR1         MCOSEL        LL_RCC_GetSourceClockMCO\n
  * @retval @arg @ref LL_RCC_MCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCOSOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCOSOURCE_MSIS
  *         @arg @ref LL_RCC_MCOSOURCE_HSI16
  *         @arg @ref LL_RCC_MCOSOURCE_HSE
  *         @arg @ref LL_RCC_MCOSOURCE_LSI
  *         @arg @ref LL_RCC_MCOSOURCE_LSE
  *         @arg @ref LL_RCC_MCOSOURCE_HSI48
  *         @arg @ref LL_RCC_MCOSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetSourceClockMCO(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_MCOSEL));
}

/**
  * @brief  Set MCO clock prescaler
  * @rmtoll CFGR1         MCOPRE        LL_RCC_SetClockPrescalerMCO\n
  * @param  MCOClockPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO_DIV_1
  *         @arg @ref LL_RCC_MCO_DIV_2
  *         @arg @ref LL_RCC_MCO_DIV_4
  *         @arg @ref LL_RCC_MCO_DIV_8
  *         @arg @ref LL_RCC_MCO_DIV_16
  *         @arg @ref LL_RCC_MCO_DIV_32
  *         @arg @ref LL_RCC_MCO_DIV_64
  *         @arg @ref LL_RCC_MCO_DIV_128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetClockPrescalerMCO(uint32_t MCOClockPrescaler)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_MCOPRE, MCOClockPrescaler);
}

/**
  * @brief  Get MCO clock prescaler
  * @rmtoll CFGR1         MCOPRE        LL_RCC_GetSourceClockMCO\n
  * @retval @arg @ref LL_RCC_MCO_DIV_1
  *         @arg @ref LL_RCC_MCO_DIV_2
  *         @arg @ref LL_RCC_MCO_DIV_4
  *         @arg @ref LL_RCC_MCO_DIV_8
  *         @arg @ref LL_RCC_MCO_DIV_16
  *         @arg @ref LL_RCC_MCO_DIV_32
  *         @arg @ref LL_RCC_MCO_DIV_64
  *         @arg @ref LL_RCC_MCO_DIV_128

  */
__STATIC_INLINE uint32_t LL_RCC_GetClockPrescalerMCO(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_MCOPRE));
}

/**
  * @brief  Set MCO2 clock source
  * @rmtoll CFGR1         MCO2SEL        LL_RCC_SetSourceClockMCO2\n
  * @param  MCO2SourceClock This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO2SOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCO2SOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCO2SOURCE_MSIS
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI16
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_LSI
  *         @arg @ref LL_RCC_MCO2SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI48
  *         @arg @ref LL_RCC_MCO2SOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSourceClockMCO2(uint32_t MCO2SourceClock)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_MCO2SEL, MCO2SourceClock);
}

/**
  * @brief  Get MCO2 clock source
  * @rmtoll CFGR1         MCO2SEL        LL_RCC_GetSourceClockMCO2\n
  * @retval @arg @ref LL_RCC_MCO2SOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCO2SOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCO2SOURCE_MSIS
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI16
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_LSI
  *         @arg @ref LL_RCC_MCO2SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI48
  *         @arg @ref LL_RCC_MCO2SOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetSourceClockMCO2(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_MCO2SEL));
}

/**
  * @brief  Set MCO2 clock prescaler
  * @rmtoll CFGR1         MCO2PRE        LL_RCC_SetClockPrescalerMCO2\n
  * @param  MCO2ClockPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO2_DIV_1
  *         @arg @ref LL_RCC_MCO2_DIV_2
  *         @arg @ref LL_RCC_MCO2_DIV_4
  *         @arg @ref LL_RCC_MCO2_DIV_8
  *         @arg @ref LL_RCC_MCO2_DIV_16
  *         @arg @ref LL_RCC_MCO2_DIV_32
  *         @arg @ref LL_RCC_MCO2_DIV_64
  *         @arg @ref LL_RCC_MCO2_DIV_128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetClockPrescalerMCO2(uint32_t MCO2ClockPrescaler)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_MCO2PRE, MCO2ClockPrescaler);
}

/**
  * @brief  Get MCO2 clock prescaler
  * @rmtoll CFGR1         MCO2PRE        LL_RCC_GetSourceClockMCO2\n
  * @retval @arg @ref LL_RCC_MCO2_DIV_1
  *         @arg @ref LL_RCC_MCO2_DIV_2
  *         @arg @ref LL_RCC_MCO2_DIV_4
  *         @arg @ref LL_RCC_MCO2_DIV_8
  *         @arg @ref LL_RCC_MCO2_DIV_16
  *         @arg @ref LL_RCC_MCO2_DIV_32
  *         @arg @ref LL_RCC_MCO2_DIV_64
  *         @arg @ref LL_RCC_MCO2_DIV_128

  */
__STATIC_INLINE uint32_t LL_RCC_GetClockPrescalerMCO2(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_MCO2PRE));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */


/**
  * @brief  Configure USARTx clock source
  * @rmtoll CCIPR1       USART1SEL     LL_RCC_SetUSARTClockSource\n
  *         CCIPR1       USART2SEL     LL_RCC_SetUSARTClockSource\n
  *         CCIPR1       USART3SEL     LL_RCC_SetUSARTClockSource\n
  * @param  USARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI16 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI16
  *
  *        (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSARTClockSource(uint32_t USARTxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[USARTxSource >> 24];
  uint8_t  pos   = (uint8_t)(USARTxSource >> 16) & 0x1FU;
  uint32_t mask  = (USARTxSource >> 8) & 0x000000FFU;
  uint32_t value = (USARTxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get USARTx clock source
  * @rmtoll CCIPR1       USART1SEL     LL_RCC_GetUSARTClockSource\n
  *         CCIPR1       USART2SEL     LL_RCC_GetUSARTClockSource\n
  *         CCIPR1       USART3SEL     LL_RCC_GetUSARTClockSource\n
  * @param  USARTx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART3_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI16 (*)
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI16
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSARTClockSource(uint32_t USARTx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[USARTx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(USARTx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (USARTx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((USARTx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Configure UARTx clock source
  * @rmtoll CCIPR1       UART4SEL     LL_RCC_SetUARTClockSource\n
  *         CCIPR1       UART5SEL     LL_RCC_SetUARTClockSource\n
  * @param  UARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSI16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUARTClockSource(uint32_t UARTxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[UARTxSource >> 24];
  uint8_t  pos   = (uint8_t)(UARTxSource >> 16) & 0x1FU;
  uint32_t mask  = (UARTxSource >> 8) & 0x000000FFU;
  uint32_t value = (UARTxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get UARTx clock source
  * @rmtoll CCIPR1       UART4SEL     LL_RCC_GetUARTClockSource\n
  *         CCIPR1       UART5SEL     LL_RCC_GetUARTClockSource\n
  * @param  UARTx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSI16
  */
__STATIC_INLINE uint32_t LL_RCC_GetUARTClockSource(uint32_t UARTx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[UARTx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(UARTx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (UARTx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((UARTx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Configure I3Cx clock source
  * @rmtoll CCIPR1       I3C1SEL       LL_RCC_SetI3CClockSource\n
  *         CCIPR1       I3C2SEL       LL_RCC_SetI3CClockSource\n
  * @param  I3CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3CClockSource(uint32_t I3CxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[I3CxSource >> 24];
  uint8_t  pos   = (uint8_t)(I3CxSource >> 16) & 0x1FU;
  uint32_t mask  = (I3CxSource >> 8) & 0x000000FFU;
  uint32_t value = (I3CxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

