stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/**
  * @brief  Get I3Cx clock source
  * @rmtoll CCIPR1       I3C1SEL     LL_RCC_GetI3CClockSource\n
  *         CCIPR1       I3C2SEL     LL_RCC_GetI3CClockSource\n
  * @param  I3Cx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3CClockSource(uint32_t I3Cx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[I3Cx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(I3Cx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (I3Cx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((I3Cx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Configure I2Cx clock source
  * @rmtoll CCIPR1       I2C1SEL       LL_RCC_SetI2CClockSource\n
  *         CCIPR1       I2C2SEL       LL_RCC_SetI2CClockSource\n
  *         CCIPR3       I2C3SEL       LL_RCC_SetI2CClockSource\n
  *         CCIPR2       I2C4SEL       LL_RCC_SetI2CClockSource\n
  * @param  I2CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_MSIK (*)
  *
  *        (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2CClockSource(uint32_t I2CxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[I2CxSource >> 24];
  uint8_t  pos   = (uint8_t)(I2CxSource >> 16) & 0x1FU;
  uint32_t mask  = (I2CxSource >> 8) & 0x000000FFU;
  uint32_t value = (I2CxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get I2Cx clock source
  * @rmtoll CCIPR1       I2C1SEL     LL_RCC_GetI2CClockSource\n
  *         CCIPR1       I2C2SEL     LL_RCC_GetI2CClockSource\n
  *         CCIPR3       I2C3SEL     LL_RCC_GetI2CClockSource\n
  *         CCIPR2       I2C4SEL     LL_RCC_GetI2CClockSource\n
  * @param  I2Cx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_MSIK (*)
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2CClockSource(uint32_t I2Cx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[I2Cx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(I2Cx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (I2Cx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((I2Cx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Configure SPIx clock source
  * @rmtoll CCIPR1       SPI1SEL       LL_RCC_SetSPIClockSource\n
  *         CCIPR1       SPI2SEL       LL_RCC_SetSPIClockSource\n
  *         CCIPR2       SPI3SEL       LL_RCC_SetSPIClockSource\n
  *         CCIPR2       SPI4SEL       LL_RCC_SetSPIClockSource\n
  * @param  SPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_MSIK (*)
  *
  *        (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPIClockSource(uint32_t SPIxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[SPIxSource >> 24];
  uint8_t  pos   = (uint8_t)(SPIxSource >> 16) & 0x1FU;
  uint32_t mask  = (SPIxSource >> 8) & 0x000000FFU;
  uint32_t value = (SPIxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get SPIx clock source
  * @rmtoll CCIPR1       SPI1SEL     LL_RCC_GetSPIClockSource\n
  *         CCIPR1       SPI2SEL     LL_RCC_GetSPIClockSource\n
  *         CCIPR1       SPI3SEL     LL_RCC_GetSPIClockSource\n
  *         CCIPR1       SPI4SEL     LL_RCC_GetSPIClockSource\n
  * @param  SPIx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK1 (*)
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_MSIK (*)
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPIClockSource(uint32_t SPIx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[SPIx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(SPIx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (SPIx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((SPIx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Configure LPTIMx clock source
  * @rmtoll CCIPR3       LPTIM1SEL     LL_RCC_SetLPTIMClockSource\n
  *         CCIPR1       LPTIM2SEL     LL_RCC_SetLPTIMClockSource\n
  *         CCIPR3       LPTIM34SEL    LL_RCC_SetLPTIMClockSource\n
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIMClockSource(uint32_t LPTIMxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[LPTIMxSource >> 24];
  uint8_t  pos   = (uint8_t)(LPTIMxSource >> 16) & 0x1FU;
  uint32_t mask  = (LPTIMxSource >> 8) & 0x000000FFU;
  uint32_t value = (LPTIMxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get LPTIMx clock source
  * @rmtoll CCIPR3       LPTIM1SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR1       LPTIM2SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR3       LPTIM34SEL    LL_RCC_GetLPTIMClockSource\n
  * @param  LPTIMx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(uint32_t LPTIMx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[LPTIMx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(LPTIMx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (LPTIMx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((LPTIMx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set FDCANx clock source
  * @rmtoll CCIPR1      FDCANSEL    LL_RCC_SetFDCANClockSource
  * @param  FDCANxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFDCANClockSource(uint32_t FDCANxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[FDCANxSource >> 24];
  uint8_t  pos   = (uint8_t)(FDCANxSource >> 16) & 0x1FU;
  uint32_t mask  = (FDCANxSource >> 8) & 0x000000FFU;
  uint32_t value = (FDCANxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get FDCANx clock source
  * @rmtoll CCIPR1       FDCANSEL    LL_RCC_GetFDCANClockSource
  * @param  FDCANx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCANClockSource(uint32_t FDCANx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[FDCANx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(FDCANx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (FDCANx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((FDCANx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set ICLK clock source
  * @rmtoll CCIPR1      ICLKSEL    LL_RCC_SetICLKClockSource
  * @param  ICLKSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_SYSCLK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetICLKClockSource(uint32_t ICLKSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[ICLKSource >> 24];
  uint8_t  pos   = (uint8_t)(ICLKSource >> 16) & 0x1FU;
  uint32_t mask  = (ICLKSource >> 8) & 0x000000FFU;
  uint32_t value = (ICLKSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get ICLK clock source
  * @rmtoll CCIPR1       ICLKSEL    LL_RCC_GetICLKClockSource
  * @param  ICLK_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_ICLK_CLKSOURCE_SYSCLK
  */
__STATIC_INLINE uint32_t LL_RCC_GetICLKClockSource(uint32_t ICLK_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[ICLK_clksource >> 24];
  uint8_t  pos   = (uint8_t)(ICLK_clksource >> 16) & 0x1FU;
  uint32_t mask  = (ICLK_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((ICLK_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set USBx clock source
  * @rmtoll CCIPR1      USB1SEL    LL_RCC_SetUSBClockSource
  * @param  USBxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB1_CLKSOURCE_ICLK
  *         @arg @ref LL_RCC_USB1_CLKSOURCE_ICLKDIV2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBClockSource(uint32_t USBxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[USBxSource >> 24];
  uint8_t  pos   = (uint8_t)(USBxSource >> 16) & 0x1FU;
  uint32_t mask  = (USBxSource >> 8) & 0x000000FFU;
  uint32_t value = (USBxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get USB clock source
  * @rmtoll CCIPR1       USB1SEL    LL_RCC_GetUSBClockSource
  * @param  USBx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USB1_CLKSOURCE_ICLK
  *         @arg @ref LL_RCC_USB1_CLKSOURCE_ICLKDIV2
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBClockSource(uint32_t USBx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[USBx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(USBx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (USBx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((USBx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set TIMIC clock source
  * @rmtoll CCIPR1      TIMICSEL    LL_RCC_SetTIMICClockSource
  * @param  TIMICxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSISDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSIKDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSISDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSIKDIV4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTIMICClockSource(uint32_t TIMICxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[TIMICxSource >> 24];
  uint8_t  pos   = (uint8_t)(TIMICxSource >> 16) & 0x1FU;
  uint32_t mask  = (TIMICxSource >> 8) & 0x000000FFU;
  uint32_t value = (TIMICxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get TIMICx clock source
  * @rmtoll CCIPR1       TIMICSEL    LL_RCC_GetTIMICClockSource
  * @param  TIMICx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSISDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSISDIV1024_MSIKDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSISDIV4
  *         @arg @ref LL_RCC_TIMIC_CLKSOURCE_HSIDIV256_MSIKDIV1024_MSIKDIV4
  */
__STATIC_INLINE uint32_t LL_RCC_GetTIMICClockSource(uint32_t TIMICx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[TIMICx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(TIMICx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (TIMICx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((TIMICx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set ADFx clock source
  * @rmtoll CCIPR2      ADF1SEL    LL_RCC_SetADFClockSource
  * @param  ADFxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_SAI1
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_AUDCLKIN
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADFClockSource(uint32_t ADFxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[ADFxSource >> 24];
  uint8_t  pos   = (uint8_t)(ADFxSource >> 16) & 0x1FU;
  uint32_t mask  = (ADFxSource >> 8) & 0x000000FFU;
  uint32_t value = (ADFxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get ADFx clock source
  * @rmtoll CCIPR2       ADF1SEL    LL_RCC_GetADFClockSource
  * @param  ADFx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_SAI1
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_AUDCLKIN
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetADFClockSource(uint32_t ADFx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[ADFx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(ADFx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (ADFx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((ADFx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set SAIx clock source
  * @rmtoll CCIPR2      SAI1SEL    LL_RCC_SetSAIClockSource
  * @param  SAIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_AUDCLKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAIClockSource(uint32_t SAIxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[SAIxSource >> 24];
  uint8_t  pos   = (uint8_t)(SAIxSource >> 16) & 0x1FU;
  uint32_t mask  = (SAIxSource >> 8) & 0x000000FFU;
  uint32_t value = (SAIxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get SAIx clock source
  * @rmtoll CCIPR2       SAI1SEL    LL_RCC_GetSAIClockSource
  * @param  SAIx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_MSIK
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_AUDCLKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAIClockSource(uint32_t SAIx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[SAIx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(SAIx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (SAIx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((SAIx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set RNGx clock source
  * @rmtoll CCIPR2      RNGSEL    LL_RCC_SetRNGClockSource
  * @param  RNGxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_RNG_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRNGClockSource(uint32_t RNGxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[RNGxSource >> 24];
  uint8_t  pos   = (uint8_t)(RNGxSource >> 16) & 0x1FU;
  uint32_t mask  = (RNGxSource >> 8) & 0x000000FFU;
  uint32_t value = (RNGxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get RNGx clock source
  * @rmtoll CCIPR2       RNGSEL    LL_RCC_GetRNGClockSource
  * @param  RNGx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RNG_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_RNG_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetRNGClockSource(uint32_t RNGx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[RNGx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(RNGx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (RNGx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((RNGx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set ADCDACx kernel clock prescaler
  * @rmtoll CCIPR2      ADCDACPRE    LL_RCC_SetADCDACClockPrescaler
  * @param  ADCDACxPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_2
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_4
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_8
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_16
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_32
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_64
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_128
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_256
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_512
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADCDACClockPrescaler(uint32_t ADCDACxPrescaler)
{
  __IO uint32_t *addr = ccipr_addr_reg[ADCDACxPrescaler >> 24];
  uint8_t  pos   = (uint8_t)(ADCDACxPrescaler >> 16) & 0x1FU;
  uint32_t mask  = (ADCDACxPrescaler >> 8) & 0x000000FFU;
  uint32_t value = (ADCDACxPrescaler >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get ADCDAC kernel clock prescaler
  * @rmtoll CCIPR2      ADCDACPRE    LL_RCC_GetADCDACClockPrescaler
  * @param  ADCDACx_clkprescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_2
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_4
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_8
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_16
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_32
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_64
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_128
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_256
  *         @arg @ref LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_512
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCDACClockPrescaler(uint32_t ADCDACx_clkprescaler)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[ADCDACx_clkprescaler >> 24];
  uint8_t  pos   = (uint8_t)(ADCDACx_clkprescaler >> 16) & 0x1FU;
  uint32_t mask  = (ADCDACx_clkprescaler >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((ADCDACx_clkprescaler & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set ADCDACx clock source
  * @rmtoll CCIPR2      ADCDACSEL    LL_RCC_SetADCDACClockSource
  * @param  ADCDACxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADCDACClockSource(uint32_t ADCDACxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[ADCDACxSource >> 24];
  uint8_t  pos   = (uint8_t)(ADCDACxSource >> 16) & 0x1FU;
  uint32_t mask  = (ADCDACxSource >> 8) & 0x000000FFU;
  uint32_t value = (ADCDACxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

