stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_rcc.h
/**
  * @brief  Get ADCDACx clock source
  * @rmtoll CCIPR2       ADCDACSEL    LL_RCC_GetADCDACClockSource
  * @param  ADCDACx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCDACClockSource(uint32_t ADCDACx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[ADCDACx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(ADCDACx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (ADCDACx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((ADCDACx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set DACx sample & hold clock source
  * @rmtoll CCIPR2      DAC1SHSEL    LL_RCC_SetDACSHClockSource
  * @param  DACxSHSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDACSHClockSource(uint32_t DACxSHSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[DACxSHSource >> 24];
  uint8_t  pos   = (uint8_t)(DACxSHSource >> 16) & 0x1FU;
  uint32_t mask  = (DACxSHSource >> 8) & 0x000000FFU;
  uint32_t value = (DACxSHSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get DACx sample & hold clock source
  * @rmtoll CCIPR2       DAC1SHSEL    LL_RCC_GetDACSHClockSource
  * @param  DACxSH_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetDACSHClockSource(uint32_t DACxSH_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[DACxSH_clksource >> 24];
  uint8_t  pos   = (uint8_t)(DACxSH_clksource >> 16) & 0x1FU;
  uint32_t mask  = (DACxSH_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((DACxSH_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set OCTOSPIx clock source
  * @rmtoll CCIPR2      OCTOSPISEL    LL_RCC_SetOCTOSPIClockSource
  * @param  OCTOSPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOCTOSPIClockSource(uint32_t OCTOSPIxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[OCTOSPIxSource >> 24];
  uint8_t  pos   = (uint8_t)(OCTOSPIxSource >> 16) & 0x1FU;
  uint32_t mask  = (OCTOSPIxSource >> 8) & 0x000000FFU;
  uint32_t value = (OCTOSPIxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get OCTOSPIx clock source
  * @rmtoll CCIPR2       OCTOSPISEL    LL_RCC_GetOCTOSPIClockSource
  * @param  OCTOSPIx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetOCTOSPIClockSource(uint32_t OCTOSPIx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[OCTOSPIx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(OCTOSPIx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (OCTOSPIx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((OCTOSPIx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @brief  Set LPUARTx clock source
  * @rmtoll CCIPR3      LPUART1SEL    LL_RCC_SetLPUARTClockSource
  * @param  LPUARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_MSIK
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUARTClockSource(uint32_t LPUARTxSource)
{
  __IO uint32_t *addr = ccipr_addr_reg[LPUARTxSource >> 24];
  uint8_t  pos   = (uint8_t)(LPUARTxSource >> 16) & 0x1FU;
  uint32_t mask  = (LPUARTxSource >> 8) & 0x000000FFU;
  uint32_t value = (LPUARTxSource >> 0) & 0x000000FFU;
  MODIFY_REG(*(__IO uint32_t *)addr, (mask << pos), (value << pos));
}

/**
  * @brief  Get LPUARTx clock source
  * @rmtoll CCIPR3       LPUART1SEL    LL_RCC_GetLPUARTClockSource
  * @param  LPUARTx_clksource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSI16
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_MSIK
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(uint32_t LPUARTx_clksource)
{
  const __IO uint32_t *const addr = ccipr_addr_reg[LPUARTx_clksource >> 24];
  uint8_t  pos   = (uint8_t)(LPUARTx_clksource >> 16) & 0x1FU;
  uint32_t mask  = (LPUARTx_clksource >> 8) & 0x000000FFU;
  uint32_t value = ((uint32_t)(READ_BIT(*addr, mask << pos)) >> pos) & 0x000000FFU;
  return (uint32_t)((LPUARTx_clksource & 0xFFFFFF00U) | value);
}

/**
  * @}
  */


/** @defgroup RCC_LL_EF_EPOD_Management EPOD
  * @{
  */

/**
  * @brief  Set EPOD booster input clock source
  * @note Set EPOD booster input clock source
  * @rmtoll CFGR4      BOOSTSEL        LL_RCC_SetEPODBoosterClkSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_BYPASS
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_MSIS
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_HSI16
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetEPODBoosterClkSource(uint32_t ClkSource)
{
  MODIFY_REG(RCC->CFGR4, RCC_CFGR4_BOOSTSEL, ClkSource);
}

/**
  * @brief  Get EPOD booster input clock source
  * @note Get EPOD booster input clock source
  * @rmtoll CFGR4      BOOSTSEL        LL_RCC_GetEPODBoosterClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_BYPASS
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_MSIS
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_HSI16
  *         @arg @ref LL_RCC_EPODBOOSTCLKSRCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetEPODBoosterClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR4, RCC_CFGR4_BOOSTSEL));
}

/**
  * @brief  Set EPOD booster input clock prescaler
  * @note Set EPOD booster input clock prescaler
  * @rmtoll CFGR4      BOOSTDIV        LL_RCC_SetEPODBoosterClkPrescaler
  * @param  ClkPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_1
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_2
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_4
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_6
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_8
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_10
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_12
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_14
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetEPODBoosterClkPrescaler(uint32_t ClkPrescaler)
{
  MODIFY_REG(RCC->CFGR4, RCC_CFGR4_BOOSTDIV, ClkPrescaler);
}

/**
  * @brief  Get EPOD booster input clock prescaler
  * @note Get EPOD booster input clock prescaler
  * @rmtoll CFGR4      BOOSTDIV        LL_RCC_GetEPODBoosterClkPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_1
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_2
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_4
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_6
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_8
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_10
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_12
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_14
  *         @arg @ref LL_RCC_EPODBOOSTCLKPRESCAL_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetEPODBoosterClkPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR4, RCC_CFGR4_BOOSTDIV));
}

/**
  * @}
  */


